Repository: Maxime2702/INGInious
Catalog: LSINF1101_adaptive/$common/student/$i18n/*.po
Languages: fr

source: You raise an unexpected exception when creating a button with invalid label '{}' and valid size and callback: {}('{}').
fr: Vous avez levé une exception alors que ce n'était pas nécessaire en créant un bouton avec un label invalide '{}' et une taille et callback valides: {} ('{}').

source: You raise an unexpected exception when creating a button with invalid callback {} and valid size and label: {}('{}').
fr: Vous avez levé une exception alors que ce n'était pas nécessaire en créant un bouton avec un callback invalide {} et une taille et un label valides : {} ('{}')

source: Changing the size of the button doesn't change the value of `size` correctly: {} instead of {}.
fr: Changer la taille du bouton ne change pas la valeur de `size` correctement: {} à la place de {}.

source: You wrongly raised an exception while creating a button with valid size {}, label '{}' and a valid callback, and changing the size to the valid size {}: {}('{}')
fr: Vous avez levé une exception alors que ce n'était pas nécessaire en créant un bouton avec une taille {}, un label '{}' et un callback valides, et changeant la taille par une taille (size) valide {} : {} ('{}')

source: You wrongly raised an exception while creating a button with valid size {}, label {} and a valid callback, and changing the size to the invalid size {} : {}('{}').
fr: Vous avez levé une exception alors que ce n'était pas nécessaire en créant un bouton avec une taille {}, un label {} et un callback valides, et changeant la taille par une taille (size) invalide {} : {} ('{}')

source: Changing the label of the button doesn't change the value of `label` correctly: {} instead of {}.
fr: Changer le label du bouton ne change pas la valeur de `label` correctement : {} à la place de {}.

source: You wrongly raised an exception while creating a button with valid size {}, label '{}' and a valid callback, and changing the label to the valid label {}: {}('{}')
fr: Vous avez levé une exception alors que ce n'était pas nécessaire en créant un bouton avec une taille {}, un label '{}' et un callback valides, et changeant le label par le label valide {} : {} ('{}')

source: You wrongly raised an exception while creating a button with valid size {}, label {} and a valid callback, and changing the label to the invalid label {} : {}('{}').
fr: Vous avez levé une exception alors que ce n'était pas nécessaire en créant un bouton avec une taille {}, un label '{}' et un callback valides, et changeant le label par le label invalide {} : {} ('{}')

source: Changing the callback of the button doesn't change the value of `callback` correctly: {} instead of {}.
fr: Changer le callback du bouton ne change pas la valeur de `callback` correctement : {} à la place de {}.

source: You wrongly raised an exception while creating a button with valid size {}, label '{}' and a valid callback, and changing the callback to a valid callback: {}('{}')
fr: Vous avez levé une exception alors que ce n'était pas nécessaire en créant un bouton avec une taille {}, un label '{}' et un callback valides, et changeant le callback par un callback valide : {} ('{}')

source: You wrongly raised an exception while creating a button with valid size {}, label {} and a valid callback, and changing the callback to an invalid callback: {}('{}').
fr: Vous avez levé une exception alors que ce n'était pas nécessaire en créant un bouton avec une taille {}, un label '{}' et un callback valides, et changeant le callback par un callback invalide : {} ('{}')

source: Calling the method `clicked()` on your button doesn't call the callback method.
fr: Appeler la méthode `clicked()` de votre bouton n'appelle pas la méthode callback.

source: You wrongly raised an exception while creating a button with valid size {}, label {} and a valid callback, and calling the callback: {}('{}').
fr: Vous avez levé une exception alors que ce n'était pas nécessaire en créant un bouton avec une taille {}, un label '{}' et un callback valides, et appelant le callback : {} ('{}')

source: You are a programmer and want to **say hello** to the user of your program. The user's name is stored in a **variable** called ``name`` and you want to store your greeting in a **variable** called ``hello``. This string will have the **following form**: "Hello, ``name``!" For example, if ``name`` is assigned "Charles", your code would put "Hello, Charles!" in the variable ``hello``. Use the ``format`` function. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>
fr: Vous êtes un programmeur et vous voulez **dire bonjour** à l'utilisateur de votre programme. Le nom de l'utilisateur est enregistré dans une **variable** appelée ``name`` et vous voulez enregistrer vos salutations dans une **variable** nommée ``hello``. Cette chaine de caractère aura la **forme suivante** : "Hello, ``name``!" Par exemple, si "Charles" est assigné à ``name``, votre code écrirait "Hello, Charles!" dans la variable ``hello``. Utilisez la fonction ``format``. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>

source: Store your greeting string in ``hello`` (with ``name`` the user's name)
fr: Enregistrez vos salutations dans ``hello`` (avec ``name`` le nom de l'utilisateur)

source: When "Charles" is the user's name, ``hello`` contains "{}" instead of "Hello, Charles!"
fr: Quand "Charles" est le nom d'utilisateur, ``hello`` contient "{}" à la place de "Hello, Charles!"

source: When "{0}" is the user's name, ``hello`` contains "{1}" instead of "Hello, {0}!"
fr: Quand "{0}" est le nom de l'utilisateur, ``hello`` contient "{1}" à la place de "Hello, {0}!"

source: Your roommate is studying in high school to become a primary school teacher. She has to teach the multiplication tables to her children in her internship. You're kind and you decided to help her. So you decided to create a list that return all the multiplication tables that she want. You have to implement a function ``mult_table(n)`` wich gives you a list of functions from 0 to n (included) that compute the multiplication table of the index. For exemple, you execute ``l = mult_table(5)`` and you receive a list of 5 functions (it has to be lambdas) where ``l[3]`` is a function that compute the multiplication table of 3 (``x = l[3](6)`` gives you 3*6). *Note: if you want to capture an outside variable for your lambda you can define a parameter that does not change. exemple: ``lambda x,y=i:x+y``* .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>
fr: Votre coloc étudie en Haute-Ecole pour devenir instituteur primaire. Il doit enseigner les tables de multiplication à ses élèves pendant son stage. Vous êtes sympa et vous décidez de l'aider. Vous créez donc une liste qui retourne toutes les tables de multiplication qu'il désire. Vous devez implémenter une fonction ``mult_table(n)`` qui vous donne une liste de fonctions allant de 0 à n (inclus) qui calculent la table de multiplication de l'index. Par exemple, vous exécutez ``l = mult_table(5)`` et vous recevez une liste de 5 fonctions (ce doivent être des lambdas) où ``l[3]`` est une fonction qui calcule la table de multiplication de 3 (``x = l[3](6)`` donne 3*6). *Note : si vous voulez capturer une variable externe pour votre lambda, vous pouvez définir un paramètre qui ne change pas. Exemple:* ``lambda x,y=i:x+y`` .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>

source: Provide the body of the following method .. code-block:: python def mult_table(n):
fr: Fournissez le corps de la méthode suivante : .. code-block:: python def mult_table(n):

source: The function {} with the argument {} of the list gives {} when the answer should be {}. You may have not captured the variable in the lambda. (see in the instructions)
fr: La fonction {} avec l'argument {} de la liste donne {} quand la réponse devrait être {}. Vous n'avez peut-être pas capturé la variable dans la lambda. (Regardez dans les instructions)

source: The length of the list is {} and it should be {}.
fr: La taille de la liste est {} et devrait être {}.

source: Once again, the **Fat Lady** drank all the wine of the *drunken monks* painting and **Sir Cadogan** isn't available to replace her. The access to the *Gryffindor Common Room* isn't guarded and the **Slytherins** are up to no good. We need you to quickly design a password checker to fill in the big void left by the *Fat Lady's departure*. Create a function ``portrait(right_password, entered_password)`` that will return ``True`` if the two passwords are identical and ``False`` otherwise. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>
fr: Une fois de plus, la **Grosse Dame** a bu tout le vin de la peinture des *moines ivres* et le **Chevalier du Catogan** n'est pas disponible pour la remplacer. L'accès à la *salle commune des Gryffondor* n'est pas gardée et les intentions des **Serpentards** sont mauvaises. Nous avons besoin que vous conceviez un vérificateur de mot de passe pour combler le vide laisser par le *départ de la Grosse Dame*. Créez une fonction ``portrait(right_password, entered_password)`` qui retourne ``True`` si les deux mots de passe sont identiques et ``False`` sinon. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>

source: Session 4: Hogwarts - Fat Lady
fr: Session 4 : Poudlard - Grosse Dame

source: Implement the function ``portrait(right_password, entered_password)`` in Python.
fr: Implémentez la fonction ``portrait(right_password, entered_password)`` en Python.

source: Are you really belonging to this house? Watch if you're really checking the equality there.
fr: Appartenez-vous vraiment à cette maison? Regardez si vous avez vraiment vérifié l'égalité.

source: Are you really belonging to this house? With the right and entered password being {} and {} you compared them as {}ly identical.
fr: Appartenez-vous vraiment à cette maison? Le vrai mot de passe est {} et celui que vous avez entré {}, vous avez testé leur égalité comme étant {}.

source: Once again, it is time for the *sorting ceremony*. The first years are waiting in line, in front of an old hat, both anxious and excited. The director makes a great speech to welcome them and gives the floor to a mysterious intervenant. Every first year is amazed when the **Sorting Hat** emerges from its silent and starts to sings one of its famous `song <http://fr.harrypotter.wikia.com/wiki/Chansons_du_Choixpeau_magique>`_. However, the old hat got a bit too far and meets now some performance issues. It is voiceless and won't be up to the task for the next part of the ceremony. Luckily enough we still have access to the founders' knowledge and we will be able to sort the students with your help. Create a function ``house_designation(student_qualities)`` that will return a list with the names of the houses from the one a student should be attributed to to the last one he sould go to. To decide his attribution, you should move him in the house in which he has the most affinities. If two houses shall be equals, return the first one in the given knowledge. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>
fr: Une fois de plus, c'est l'heure de la *cérémonie de la répartition* . Les premières années attendent en rangs devant un vieux chapeau, à la fois anxieux et excités. Le directeur fait un long discours pour les accueillir et laisse la place à un mystérieux intervenant. Tous les premières années sont ébahis lorsque le **Choixpeau Magique** brise le silence en chantant l'une de ses célèbres `chansons <http://fr.harrypotter.wikia.com/wiki/Chansons_du_Choixpeau_magique>`_. Cependant, le choixpeau en fait un peu trop et rencontre quelques problèmes. Il perd sa voix et ne sera pas en état d'assurer la suite de la cérémonie. Heureusement, nous avons toujours accès aux connaissances des fondateurs et nous pourrons répartir les élèves avec votre aide. Créez une fonction ``house_designation(student_qualities)`` qui va retourner une liste avec les noms des quatres maisons, la première étant celle où l'étudiant devrait aller et la dernière, celle qui convient le moins à l'étudiant. Pour décider de cette répartition, l'étudiant devrait être placé dans la maison où il a le plus d'affinités, c'est-à-dire, la maison avec laquelle il partage le plus de qualités. Si deux maisons sont à égalité, on les retourne dans l'ordre dans lequel elles sont placées dans les connaissances des fondateurs. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>

source: Session 5: Hogwarts - Sorting Hat
fr: Session 5 : Poudlard - Choixpeau Magique

source: Implement the function ``house_designation(student_qualities)`` in Python. You already have the ancestral knowledge of the **Hat** at your disposal: .. code-block:: python knowledge = [['Gryffindor', ['brave', 'strong', 'bold']], ['Ravenclaw', ['smart', 'wise', 'curious']], ['Hufflepuff', ['loyal', 'patient', 'hard-working']], ['Slytherin', ['cunning', 'wily', 'malignant']]]
fr: Implémentez la fonction ``house_designation(student_qualities)`` en Python. Vous avez déjà la connaissance ancestrale du **Choixpeau** à votre disposition : .. code-block:: python knowledge = [['Gryffindor', ['brave', 'strong', 'bold']], ['Ravenclaw', ['smart', 'wise', 'curious']], ['Hufflepuff', ['loyal', 'patient', 'hard-working']], ['Slytherin', ['cunning', 'wily', 'malignant']]]

source: Should you really belong to this house? Wasn't there any equals houses for the qualities {}?
fr: Devriez-vous vraiment faire partie de cette maison? N'y avait-il pas une autre maison à égalité pour les qualités {} ?

source: Should you really belong to this house? Your returned {}, wasn't there an order more suited for the qualities {}?
fr: Devriez-vous vraiment faire partie de cette maison? Vous avez retourné{}, n'y avait-il pas un ordre plus adéquat pour les qualités {} ?

source: All your life you wondered *"Where did this stupid owl misplace my letter?"*, *"When will I finally go to Hogwarts?"* or even on the end *"Am I actually a squib?"*. Do not worry! **Hogwarts** finally contacted you for an important task. Even if you're too old to learn **witchcraft**, they're lucky because you learned a different kind of magic: **programming**. They decided to modernize a bit their admission services and want you to create a program that will be able to fill a file (template of the admission letter) with the name of a student. This way, they will be able to save on the feathers and reduce the workload of the elves! .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>
fr: Toute votre vie vous vous êtes demandé *"Où cette stupide chouette a-t-elle égaré ma lettre ?"*, *"Quand irais-je enfin à Poudlard ?"* ou même à la fin *"Suis-je un Cracmol ?"*. Ne vous inquiétez pas! **Poudlard** vous a enfin contacté pour une tâche importante. Même si vous êtes trop vieux pour apprendre la **sorcellerie**, ils ont de la chance parce que vous avez appris une différente sorte de magie : **la programmation**. Ils ont décidé de moderniser un peu leurs services d'admission et veulent que vous créiez un programme qui sera capable de remplir un fichier (template d'un lettre d'admission) avec le nom de l'étudiant. De cette manière, ils pourront réduire le coût en plumes et réduire la charge de travail des elfes! .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>

source: Session 6: Hogwarts - Admission letter
fr: Session 6 : Poudlard - Lettre d'admission

source: Implement the function ``write(letter_template, name)`` in Python. Don't forget to raise an exception if any should occur.
fr: Implémentez la fonction ``write(letter_template, name)`` en Python. N'oubliez pas de lever une exception si elle se produit.

source: HOGWARTS SCHOOL of WITCHCRAFT and WIZARDRY Headmaster : Albus Dumbledore (Order of Merlin, First Class, Grand Sorc., Chf. Warlock, Supreme Mugwump, International Confed. of Wizards) Dear Mr/Ms. #, We are pleased to inform you that you have been accepted at Hogwarts School of Witchcraft and Wizardry. Please find enclosed a list of all necessary books and equipment. Term begins on 1 September. We await your owl by no later than 31 July. Yours sincerely, Minerva McGonagall Deputy Headmistress
fr: ECOLE de MAGIE et de SORCELLERIE de POUDLARD Directeur : Albus Dumbledore (Ordre de Merlin, Première classe, Grand Sorc., Chf. Démoniste, Suprême Mugwump, Confédéré international. des sorciers) Cher M./Mme #, Nous avons le plaisir de vous informer que vous avez été accepté à l'Ecole de Magie et de Sorcellerie de Poudlard. Veuillez trouver ci-joint une liste de tous les livres et équipements nécessaires. Les cours débutent le 1er septembre. Nous attendons votre chouette pour le 31 juillet au plus tard. Cordialement, Minerva McGonagall Directrice Adjointe

source: The letter expected of the given file was {} and you returned {}.
fr: La lettre attendue pour le fichier donné est {} et vous avez retourné {}.

source: The rules of *Quidditch* were established in 1750 by the **Department of Magic Games and Sports**. And it is nowhere said that the referee can't use a bit of help. **Madam Hooch** is quite busy already looking for *blatching*, *blurting*, *blagging* and many other nasty quidditch faults. So she thought you could design a program that would decide the winner of a match based on the list of the points. The scores list would be provided as a file. The content of this file would follow this format: - Two first lines: **Names of the teams** - Lines after: **Team_scoring** *points* In case of error, just raise it. Remember that the catch of the *golden snitch* (150 points) means the end of the match. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>
fr: Les règles du *Quidditch* ont été établie en 1750 par le **Département des jeux et sports magiques**. Et il n'est dit nul part que l'arbitre ne peut recevoir un petit coup de main. **Madame Bibine** est plutôt occupée à regarder pour le *boutenchoc*, le *croc-en-manche*, le *hochequeue* et tout un tas d'autres vilaines fautes de Quidditch. Donc elle a pensé que vous pourriez écrire une programme qui déciderait le vainqueur d'un match en se basant sur la liste des points. La liste des scores serait fournie dans un fichier. Le contenu de ce fichier suivrait le format suivant : - Les deux premières lignes : **Noms des équipes** - Les lignes qui suivent : **Team_scoring** *points* S'il y a une erreur, pensez à lever une exception. Rappelez-vous qu'attraper le *vif d'or* en plus de rapporter 150 points marque la fin du match. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>

source: Session 6: Hogwarts - Quidditch
fr: Session 6 : Poudlard - Quidditch

source: Implement the function ``referee(score_file)`` in Python.
fr: Implémentez la fonction ``referee(score_file)`` en Python.
