Repository: Maxime2702/INGInious
Catalog: LSINF1101_adaptive/$common/student/$i18n/*.po
Languages: fr

source: Suppose we have a multi-level depth list of which the elements are all strings. *Example*: ["a",["b","6"],"e",["5",["g","h"]],"i"] Create a function deepconcat(l) that traverses this structure and creates a new string which is the concatenation of all the strings appearing in that structure. *Example*: deepconcat(["a",["b","6"],"e",["5",["g","h"]],"i"]) => returns "ab6de5ghi" .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>
fr: Supposons que nous ayons une liste avec plusieurs niveaux dans laquelle tous les éléments sont des strings. *Example*: ["a",["b","6"],"e",["5",["g","h"]],"i"] Create a function deepconcat(l) that traverses this structure and creates a new string which is the concatenation of all the strings appearing in that structure. *Example*: deepconcat(["a",["b","6"],"e",["5",["g","h"]],"i"]) => returns "ab6de5ghi" .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>

source: Session 8: Deep concatenation
fr: Session 8 : Concaténation

source: Implement the function ``deep_concat(l)`` in Python.
fr: Implémentez la fonction ``deep_concat(l)`` en Python.

source: You did not name the method as expected.
fr: Vous n'avez pas nommé la méthode comme attendu.

source: The flatten version of {} is supposed to be an empty string and you returned {}. You should watch you behaviour in case of empty lists.
fr: La version aplatie de {} doit être une string vide et vous avez retourné {}. Vous devriez regarder le comportement de votre programme dans le cas de listes vides.

source: The flatten version of {} is {} and you returned {}.
fr: La version aplatie de {} est {} et vous avez retourné {}.

source: You are still working on your next big game, *God of massive destruction Game Of The Century edition*, and now you need to implement a better combat system. For this exercice, you will need to implement three classes : ``Character``, ``Cratos`` and ``Drauf``. Your manager thought it was too easy with a weapon, so *Cratos* will fight with is bare fists for this exercice. So no weapons. ``Cratos`` and ``Drauf`` will inherit from ``Character``. * The ``Cratos`` class represent the player, and the ``Drauf`` is a basic ennemy. * The ``Character`` class will have to have the attributes ``life`` and ``attack_point``, and the functions ``attack`` and ``get_hit``. * The ``Cratos`` class also have an attribute ``experience`` and a ``function gain_XP``. * *Cratos* starts with 100 life, 10 damage and 0 experience. The *Drauf* will have its variables set with the constructor. * The function ``attack`` will get a ``Character`` to attack as parameter. * The function ``get_hit`` will reduce the ``life`` of the object by the ``damage`` indicated as parameter. * The function ``gain_XP`` will increase the XP of the player by the ``amount`` in parameters. Every 10 point of experience, the damage of *Cratos* will increase by 1 (the amount of XP gain can be higher than 10; be careful to take that in account) .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>
fr: Vous travaillez toujours sur votre prochain gros jeu, *Dieu de la Destruction Massive : Edition Jeu du Siècle*, et vous devez maintenant implémenter un meilleur système de combat. Pour cet exercice, vous aurez besoin de trois classes : ``Character``, ``Cratos`` and ``Drauf``. Votre manager pensait que c'était trop facile avec une arme, donc *Cratos* va se battre à mains nues pour cet exercice. Donc pas d'armes. ``Cratos`` et ``Drauf`` héritent de ``Character``. * La classe ``Cratos`` représente le joueur, et la classe ``Drauf`` représente un ennemi basique. * La classe ``Character``devra posséder les attributs ``life`` et ``attack_point``, et les fonctions ``attack`` et ``get_hit``. * La classe ``Cratos`` a aussi un attribut ``experience`` et une fonction ``gain_XP``. * *Cratos* commence avec 100 vies, 10 dommages et 0 experience. Les variables de *Drauf* seront définies dans le constructeur . * La fonction ``attack`` reçoit en paramètre un ``Character`` à attaquer. * La fonction ``get_hit`` réduit l'attribut ``life`` de l'objet par le nombre de ``damage``indiqué en paramètre. * La fonction ``gain_XP`` augmente l'expérience par la valeur de ``amount``dans les paramètres. Tous les 10 points d'expérience, les dommages de *Cratos* augmentent de 1 (la quantité d'expérience gagnée peut-être supérieure à 10; n'oubliez pas de prendre cela en compte) .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>

source: Session 10: Kill them all
fr: Session 10 : Tuez les tous

source: You have to implement the following : The class ``Character`` .. code-block:: python #attributes life attack_point #functions attack(target) get_hit(damage) The class ``Cratos`` .. code-block:: python #attributes experience #functions __init__() gain_XP(amount) The class ``Drauf`` .. code-block:: python #functions __init__(life, damage)
fr: Vous devez implémenter les choses suivantes : La classe ``Character`` .. code-block:: python #attributs life attack_point #fonctions attack(target) get_hit(damage) La classe``Cratos`` .. code-block:: python #attributs experience #fonctions __init__() gain_XP(amount) La classe ``Drauf`` .. code-block:: python #fonction __init__(life, damage)

source: Does the class `Character` exist?
fr: Est-ce que la classe `Character` existe?

source: Does the class `Cratos` exist?
fr: Est-ce que la classe `Cratos` existe?

source: Does the class `Drauf` exist?
fr: Est-ce que la classe `Drauf`existe?

source: Your class `Character` does not have an attribute `life`.
fr: Votre classe `Character` n'a pas d'attribut `life`.

source: Your class `Character` does not have a method `attack`.
fr: Votre classe `Character` n'a pas de méthode `attack`.

source: Your class `Character` does not have a method `get_hit`.
fr: Votre classe `Character` n'a pas de méthode `get_hit`.

source: Your class `Character` does not have an attribute `attack_point`.
fr: Votre classe `Character` n'a pas d'attribut `attack_point`.

source: Your class `Cratos` does not have a method `gain_XP`.
fr: Votre classe `Cratos` n'a pas de méthode `gain_XP`.

source: Your class `Drauf` have a method `gain_XP` which it shouldn't have.
fr: Votre classe `Drauf` a une méthode `gain_XP` qu'elle ne devrait pas avoir.

source: Your class `Drauf` have an attribute `experience` which it shouldn't have.
fr: Votre classe `Drauf`a un attribut `experience` qu'elle ne devrait pas avoir.

source: The Cratos constructed has not the good life, it has {} instead of {}
fr: Le Cratos construit n'a pas la bonne quantité de vie (life), il a {} à la place de {}.

source: The Cratos constructed has not the good attack_point, it has {} instead of {}
fr: Le Cratos construit n'a pas la bonne quantité de points d'attaque (attack_point), il a {} à la place de {}.

source: The Cratos constructed has not the good experience, it has {} instead of {}
fr: Le Cratos construit n'a pas la bonne quantité d'expérience, il a {} à la place de {}.

source: The Drauf constructed has not the good life, it has {} instead of {}
fr: Le Drauf construit n'a pas la bonne quantité de vie (life), il a {} à la place de {}.

source: The Drauf constructed has not the good attack_point, it has {} instead of {}
fr: Le Drauf construit n'a pas la bonne quantité de points d'attaque (attack_point), il a {} à la place de {}.

source: The Cratos has not the good attack_point, it has {} instead of {}
fr: Le Cratos n'a pas la bonne quantité de points d'attaque (attack_point), il a {} à la place de {}.

source: The Cratos has not the good experience, it has {} instead of {}
fr: Le Cratos n'a pas la bonne quantité d'expérience, il a {} à la place de {}.

source: The Cratos has not the good life, it has {} instead of {}
fr: Le Cratos n'a pas la bonne quantité de vie (life), il a {} à la place de {}.

source: The Drauf has not the good attack_point, it has {} instead of {}
fr: Le Drauf n'a pas le bon nombre de points d'attaque (attack_point), il a {} à la place de {}.

source: The Drauf has not the good life, it has {} instead of {}
fr: Le Drauf n'a pas la bonne quantité de vie (life), il a {} à la place de {}.

source: You are still working on your next big game, *God of massive destruction Game Of The Century edition*, and now you need to implement a basic combat system. For this exercise, you will need to implement three classes : ``Cratos``, ``Drauf`` and ``Weapon``. The ``Cratos`` class represent the player, the ``Drauf`` is a basic ennemy, and the ``Weapon`` is a weapon usable by *Cratos*. * For the moment, only *Cratos* can attack. * *Cratos* can equip a *Weapon*, and hit a *Drauf*. * The *Weapon* has a certain attack, and the *Drauf* has life. * The Drauf has the ``method get_hit(damage)`` and Cratos has the function ``hit(ennemy)``. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>
fr: Vous travaillez toujours sur votre prochain gros jeu, *Dieu de la Destruction Massive : Edition Jeu du Siècle*, et vous devez maintenant implémenter un système de combat basique. Pour cet exercice vous allez devoir implémenter trois classes: ``Cratos``, ``Drauf`` and ``Weapon``. La classe ``Cratos`` représente le joueur, et la classe ``Drauf`` représente un ennemi basique, et la classe ``Weapon`` est une arme qui peut-être utilisée par *Cratos*. * Pour le moment, seul *Cratos* peut attaquer. * *Cratos* peut s'équiper d'une *Weapon*, et frapper *Drauf*. * La *Weapon* a une certaine attaque (attack), et le *Drauf* a de la vie (life). * Le Drauf a la méthode ``get_hit(damage)`` et Cratos a la fontion ``hit(ennemy)``. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>

source: Session 9: Kill an ennemy
fr: Session 9 : Tuez un ennemi

source: You have to implement the following : The class ``Weapon`` .. code-block:: python #attributes attack #methods __init__(attack) The class ``Cratos`` .. code-block:: python #attributes weapon #methods __init__(weapon) set_weapon(weapon) # change the weapon hit(enemy) # hit the ennemy with the weapon attack and reduce its hp The class ``Drauf`` .. code-block:: python #attributes life #methods __init__(life) get_hit(damage) # reduce the life by the damage taken
fr: Vous devez implémenter les choses suivantes : La classe ``Weapon`` .. code-block:: python #attributs attack #méthodes __init__(attack) La classe ``Cratos`` .. code-block:: python #attributs weapon #methods __init__(weapon) set_weapon(weapon) # change l'arme (weapon) hit(enemy) # frappe l'ennemi avec l'attaque de l'arme (weapon) et réduit son hp La classe ``Drauf`` .. code-block:: python #attributs life #méthodes __init__(life) get_hit(damage) # réduit la vie (life) par le nombre de dommages infligés (damage)

source: Does the class `Weapon` exist?
fr: Est-ce que la classe `Weapon` existe?

source: Your class `Cratos` does not have a method `__init__`.
fr: Votre classe `Cratos` n'a pas de méthode `__init__`.

source: Your class `Cratos` does not have an attribute `weapon`.
fr: Votre classe `Cratos` n'a pas d'attribut `weapon`.

source: Your class `Cratos` does not have a method `set_weapon`.
fr: Votre classe `Cratos` n'a pas de méthode `set_weapon`

source: Your class `Cratos` does not have a method `hit`.
fr: Votre classe `Cratos`n'a pas de méthode `hit`.

source: Your class `Weapon` does not have a method `__init__`.
fr: Votre classe `Weapon` n'a pas de méthode `__init__`.

source: Your class `Weapon` does not have an attribute `attack`.
fr: Votre classe `Weapon` n'a pas d'attribut `attack`.

source: Your class `Drauf` does not have a method `__init__`.
fr: Votre classe `Drauf` n'a pas de méthode `__init__`.

source: Your class `Drauf` does not have an attribute `life`.
fr: Votre classe `Drauf` n'a pas d'attribut `life`.

source: Your class `Drauf` does not have a method `get_hit`.
fr: Votre classe `Drauf`n'a pas de méthode `get_hit`.

source: The Weapon constructed has not the good attack, it has {} instead of {}
fr: La Weapon construite n'a pas la bonne quantité d'attaque (attack), elle a {} à la place de {}.

source: The Cratos constructed has not the good weapon, make sure you set it in the constructor
fr: Le Cratos construit n'a pas la bonne arme (weapon), assurez-vous de l'avoir bien définie dans le constructeur.

source: The Weapon has not the good attack, it has {} instead of {}
fr: La Weapon n'a pas la bonne quantité d'attaque, il a {} à la place de {}.

source: The Cratos has not the good weapon, make sure set_weapon is correct
fr: Le Cratos n'a pas la bonne arme (weapon), assurez-vous que set_weapon est correct.

source: The method ``diff_count(lst)`` returns the number of different elements contained in the list ``lst``. *For example:* - If ``lst`` equals ``[3, 5, 3]`` then the method should return 2. - If all the elements are the same, it should return 1. - If the list ``lst`` is empty, it should return 0. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>
fr: La méthode ``diff_count(lst)`` retourne le nombre d'éléments différents contenus dans la liste ``lst``. *Par exemple:* - Si ``lst`` est égal à ``[3, 5, 3]`` alors la méthode devrait retourner 2. - Si tous les éléments sont les mêmes, la méthode devrait retourner 1. - Si la liste ``lst`` est vide, elle devrait retourner 0. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>

source: Session 4: Difference counter
fr: Session 4 : Compteur de différence

source: Provide the body of the following method: .. code-block:: python def diff_count(lst):
fr: Fournissez le corps de la méthode : .. code-block:: python def diff_count(lst):

source: The number of different elements of {} is {} and you returned {}.
fr: Le nombre d'éléments différents de {} est {} et vous avez retourné {}.

source: A student in the 3rd year Bachelor told you, he learned about the *Turing Machine* in his course of *Calculability*. The *Turing Machine* works with a memory tape. It's an infinitly long tape with character in it. He told you, that it's really complicated but he tends to exaggerate all the time. You want to prove him that it's not so complicated and you'll implement a tape like the *Turing Machine*. You have to create a LinkedList where each ``Node`` has a link with the previous and the next ``Node``. You have in all time a pointer to a ``Node`` and you can move the pointer to the left and to the right. This pointer allow you to read the string in the node you're looking at. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>
fr: Un étudiant de 3ème BAC vous a dit qu'il avait entendu parlé des *machines de Turing* dans son cours de *Calculabilité*. La *Machine de Turing* fonctionne avec une bande de mémoire. C'est un ruban infini avec des caractères dedans. Il vous a dit que c'était vraiment compliqué mais il a une forte tendance à l'exagération. Vous voulez lui prouver que ce n'est pas si difficile et que vous allez implémenter un ruban comme une *Machine de Turing*. Vous devez créer une liste chainée (LinkedList) où chaque noeud (``Node``) a un lien avec le noeud qui le précède et celui qui lui succède. A tout moment, vous avez un pointeur vers un ``Node`` et vous pouvez déplacer le pointeur vers la gauche ou la droite. Ce pointeur vous permet de lire la chaine de caractère dans le noeud qu'on est en train de regarder. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>

source: Session 11 : Double Link
fr: Session 11 : Double liens

source: Node
fr: Noeud

source: Create the class ``Node`` with at least the following methods: .. code-block:: python def __init__(s) def get_text() def set_text(s) The ``Node`` has a link with the previous and the next ``Node``. Each ``Node`` contains its own ``value``, a string. The methods ``get_text`` return the string in the ``Node``. And ``set_text`` change the string by ``s``.
fr: Créez une classe ``Node`` avec au moins les méthodes suivantes : .. code-block:: python def __init__(s) def get_text() def set_text(s) Le ``Node`` a un lien avec le précédent et avec le suivant. Chaque ``Node`` contient sa propre valeur (``value``), une chaine de caractère. La méthode ``get_text`` retourne la chaine de caratère présente dans le ``Node``. Et ``set_text`` change la chaine de caractère par ``s``.

source: Double LinkedList
fr: Liste doublement chainée

source: Create the class ``Tape`` with at least the following methods: .. code-block:: python def __init__() def next() def previous() def get_length() def add(s) def write(s) def read() * The ``next()`` method advance of one node and after give the value of the ``Node`` reached. * The ``previous()`` method step back of one node and give the value of the ``Node`` reached. * The ``next()`` and ``previous()`` methods return ``None`` and doesn't move if there is no ``Node`` to reach. * The ``get_length()`` method return the *number of Nodes* in the ``Tape``. * The ``add(s)`` method add a new ``Node`` with the string ``s`` in last place. To call this method with no *Node* put the pointer on the *first Node*. To call this method when there is already a *Node* doesn't change the position of the pointer. * The ``write(s)`` method change the string of the actual node with ``s``. If There is no node, it does nothing. * The ``read()`` method return the string of the actual node. If There is no node, it return ``None``.
fr: Créez la classe ``Tape`` avec au moins les méthodes suivantes: .. code-block:: python def __init__() def next() def previous() def get_length() def add(s) def write(s) def read() * ``next()`` avance d'un noeud et ensuite donne la valeur du ``Node`` atteint. * ``previous()`` recule d'un noeud et renvoit la valeur du ``Node`` atteint. * les méthodes ``next()`` et ``previous()`` renvoient ``None`` et ne déplacenet pas le pointeur s'il n'y a pas de ``Node`` à atteindre. * La méthode ``get_length()`` renvoit le *nombre de Nodes* dans ``Tape``. * ``add(s)`` ajoute un nouveau ``Node`` avec le string ``s`` en dernière position. Appeler cette méthode dans un ``Tape`` sans *Node* met le pointeur sur le *premier Node*. Appeler cette méthode sur un ``Tape`` ayant déjà un *Node* ne change pas la position du pointeur. * ``write(s)`` change le string actuel du ``Node`` pointé par ``s``. S'il n'y a pas de node, il ne se passe rien. * ``read()`` renvoit le string du node actuel. S'il n'y a pas de node, cela renvoit ``None``.

source: @1@: The Node class does not have the method {}
fr: @1@: La classe Node n'a pas la méthode {}

source: @2@: The Tape class does not have the method {}
fr: @2@: La classe Tape n'a pas la méthode {}

source: @1@: node.get_text() give {} and it should give {}
fr: @1@: node.get_text() donne {} et ça devrait donner {}

source: Be sure you don't have any infinite loop.
fr: Assurez-vous de ne pas avoir de boucle infinie.

source: @2@: Method init or read doesn't work. read() has given {} and it should have returned {}
fr: @2@: La méthode init ou read ne fonctionne pas. read() a donné {} et aurait du retourner {}

source: @2@: Method next doesn't work.
fr: @2@: La méthode next ne fonctionne pas.

source: @2@: Method previous doesn't work.
fr: @2@: La méthode previous ne fonctionne pas.

source: @2@: Method length doesn't give the good answer. It gives {} and it should give {}
fr: @2@: La méthode length ne donne pas la bonne réponse. Elle donne {} et devrait donner {}

source: @2@: Method write/read doesn't work. read() gives {} and it should give {}
fr: @2@: La méthode write/read ne fonctionne pas. read() donne {} et devrait donner {}
