Repository: Maxime2702/INGInious
Catalog: LSINF1101_adaptive/$common/student/$i18n/*.po
Languages: fr

source: You want to use your computer to easily compute a polynomial with the following form: :math:`y = a x^6 + b x^2 + c`. We give you the coefficients (stored in ``a``, ``b`` and ``c``) and the variable ``x`` and ask you to put the value of the polynomial at abscissa :math:`x` inside a variable named ``y``. *Note: there is a way to make this shortly in only one line of code.* .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>
fr: Vous voulez utiliser votre ordinateur pour facilement calculer un polynôme de la forme suivante : :math:`y = a x^6 + b x^2 + c`. Nous vous donnons les coefficients (enregistrer dans ``a``, ``b`` et ``c``) et la variable ``x`` et vous demandons de donner la valeur du polynôme en abscisse :math:`x` dans une variable nommée ``y``. *Note: il est possible de faire ceci en une seule ligne de code.* .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>

source: Session 1: Polynomial
fr: Session 1 : Polynôme

source: .. code-block:: python y = ... # Value of the polynomial at abscissa `x`
fr: .. code-block:: python y = ... # valeur du polynôme en abscisse `x`

source: With a={}, b={}, c={} and x={}, your code computes {} instead of {}.
fr: Avec a={}, b={}, c={} et x={}, votre code calcule {} à la place de {}.

source: `The prime numbers <https://en.wikipedia.org/wiki/Prime_number>`_ , used by mathematicians, are a set of numbers sharing a same property. A prime is a natural number greater than 1 that has no positive divisors other than 1 and itself. A natural number greater than 1 that is not a prime number is called a composite number. To calculate prime numbers you can use the principle of *Eratosthene's sieve*: for each successive number, check if it is divisible by the lower prime numbers already found. If it is not divisible by any, it is prime and can be added to the list. Implement the function ``primes(max)`` that returns the list of all prime numbers until ``max``. If ``max`` is negative or zero, the empty list should be returned. To limit the complexity of your solution, decompose into auxiliary functions as needed. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>
fr: `Les nombres premiers <https://fr.wikipedia.org/wiki/Nombre_premier>`_ , utilisés par les mathématiciens, sont un ensemble de nombres partageant une même propriété. Un nombre premier est un nombre naturel plus grand que 1 qui n'a aucun diviseur positif en dehors de 1 et lui-même. Un nombre naturel plus grand que 1 qui n'est pas premier est appelé un nombre composé. Pour calculer les nombres premiers, vous pouvez utiliser le principe de *Crible d'Erathosthène* : pour chaque nombre successif, regardez s'il est divisible par l'un des nombres premiers que vous avez déjà trouvé. S'il n'est divisible par aucun, il est premier et peut être ajouté à la liste. Implémentez la fonction ``primes(max)`` qui retourne la liste de tous les nombres premiers jusqu'à ``max``. Si ``max`` est négatif ou zéro, une liste vide doit être retournée. Pour limiter la complexité de votre solution, décomposez la en plusieurs fonctions auxiliaires. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>

source: Session 4: Prime numbers
fr: Session 4 : Nombres premiers

source: Implement the function ``primes(max)`` in Python.
fr: Implémentez la fonction ``primes(max)`` en Python.

source: The prime numbers with a maximum value of {} is {} and you returned {}.
fr: La liste des nombres premiers avec une valeur maximale de {} est {} et vous avez retourné {}.

source: The prime numbers with a maximum value of {} is {} and you returned {}. You should check the conditions to be a prime number.
fr: La liste des nombres premiers avec une valeur maximale de {} est {} et vous avez retourné {}. Vous devriez vérifier les conditions pour être un nombre premier.

source: The `Body mass index (BMI) <https://en.wikipedia.org/wiki/Body_mass_index>`_ or Quetelet index, used by dieticians, is indicative of the condition of a person. A normal person should have an index between 20 and 25. Below 20, she is considered thin, above 25 overweight. Beyond 30, the person is obese! This index is calculated as the ratio between a person's weight, expressed in kg, and the square of the person's height, expressed in meters. Create a function ``quetelet(height, weight)`` to calculate a person's Quetelet index and return ``thin`` string for a person with an index strictly less than 20, ``normal`` for a person whose index is between 20 and 25, ``overweight`` if the index is strictly greater than 25 and less than or equal to 30 and ``obese`` when it is strictly greater than 30. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>
fr: `L'indice de masse corporelle (BMI) <https://fr.wikipedia.org/wiki/Indice_de_masse_corporelle>`_ ou indice de Quételet, utilisé par les diététiciens, est révélateur de la condition d'une personne. Un personne normale devrait avoir un indice se trouvant entre 20 et 25. En dessous de 20, elle est considérée mince et au dessus de 25, elle est en surpoids. Au delà de 30, la personne est obèse! Cet indice est calculé comme le ratio entre le poids de la personne, exprimée en kg, et le carré de la taille de la personne, exprimée en mètres. Créez une fonction ``quetelet(height, weight)`` qui calcule l'indice de Quételet d'une personne et retourne ``thin`` pour les personnes avec un indice strictement plus petits que 20, ``normal`` pour une personne dont l'indice est entre 20 et 25, ``overweight`` si l'index est strictement plus grand que 25 et moins que ou égal à 30 et ``obese`` quand l'indice est plus grand que 30. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>

source: Session 3: BMI index
fr: Session 3 : Indice BMI

source: Implement the function ``quetelet(height, weight)`` in Python.
fr: Implémentez la fonction ``quetelet(height, weight)`` en Python.

source: The quetelet index with a height of {} and a weight of {} is {} and you returned {}. You should watch the bounds of your conditions.
fr: L'indice de Quételet avec une taille de {} et un poids de {} est {} et vous avez retourné {}. Vérifiez les bornes de vos conditions.

source: The quetelet index with a height of {} and a weight of {} is {} and you returned {}.
fr: L'indice de Quételet avec une taille de {} et un poids de {} est {} et vous avez retourné {}.

source: In mathematics, the factorial of a strictly positive integer ``x``, noted :math:`x!` is defined as the product of all strictly positive integers less than or equal to ``x``. The factorial of 0 is defined as 1. Write a function that computes the factorial of a given integer x. *Examples*: * :math:`5! = 5 × 4 × 3 × 2 × 1 = 120` * :math:`0! = 1` Note that is essentially the same question as one that was asked in the first session, except that we now expect you to solve it differently. The use of ``while`` and ``for`` loops will be prohibited and you are expected to solve it by writing a recursive function. We also want you to return ``None`` whenever the factorial cannot be computed. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>
fr: En mathématiques, la factorielle d'un entier strictement positif ``x``, noté :math:`x!` est défini comme le produit de tous les entiers strictement positifs plus petits ou égaux à ``x``. La factorielle de 0 est définie comme 1. Ecrivez une fonction qui calcule la factorielle d'un entier donné x. *Exemples*: * :math:`5! = 5 × 4 × 3 × 2 × 1 = 120` * :math:`0! = 1` Notez que cette question est la même qu'une question de la première session sauf qu'on s'attend à ce que vous la résolviez différemment maintenant. L'utilisation de boucles ``while`` et ``for`` est interdite et vous devez utiliser une fonction récursive. Nous voulons que vous retourniez ``None`` quand la factorielle ne peut pas être calculée.. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>

source: Session 8: Factorial
fr: Session 8 : Factorielle

source: Provide the body of the following method: .. code-block:: python def factorial(x):
fr: Donnez le corps de la méthode suivante : .. code-block:: python def factorial(x):

source: You did not use recursion in your algorithm
fr: Vous n'avez pas utilisé la récursion dans votre algorithme

source: The factorial of a negative integer {} should be None and you returned {}.
fr: La factorielle d'un entier négatif {} devrait être None et vous avez retourné {}.

source: In mathematics, the `Fibonacci series <https://en.wikipedia.org/wiki/Fibonacci_number>`_ are the numbers in the following sequence of integers, which are characterized by the fact that every number after the first two is the sum of the two preceding ones: Example: :math:`0, 1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89, 144, ...` A very simple algorithm would be: $$\\text{F}_0 = 0$$ $$\\text{F}_1 = 1$$ $$\\text{F}_n = \\text{F}_{n-1} + \\text{F}_{n-2}$$ Adapt the function which you implemented in session 3 to create a recursive solution to this exercise. You should also return ``None`` in the case of an incongruous input. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>
fr: En mathématiques, la `suite de Fibonacci <https://fr.wikipedia.org/wiki/Suite_de_Fibonacci>`_ sont les nombres dans la séquence suivante d'entiers, qui est caractérisée par le fait que chaque nombre après les deux premiers est égal à la somme des deux précédents : Exemple: :math:`0, 1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89, 144, ...` Un algorithme très simple serait : $$\\text{F}_0 = 0$$ $$\\text{F}_1 = 1$$ $$\\text{F}_n = \\text{F}_{n-1} + \\text{F}_{n-2}$$ Adaptez la fonction que vous avez implémenté dans la session 3 pour créer une solution récursive à cet exercice. Vous devez retourné ``None`` dans le cas d'une mauvaise entrée. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>

source: Provide the body of the following method: .. code-block:: python def fibo(x):
fr: Donnez le corps de la méthode suivante : .. code-block:: python def fibo(x):

source: You did not use recursion in your algorithm.
fr: Vous n'avez pas utilisé la récursion dans votre algorithme.

source: There can not be a number in a negative place in a sequence, you should have returned None.
fr: Il ne peut pas y avoir un nombre à une place négative dans une séquence, vous auriez du retourner None.

source: The method ``sum(list)`` returns the sum of the elements contained in ``list``. Example: the sum of :math:`[1, 2, 3]` is :math:`6` Note that your algorithm should be able to compute the sum even when the list ``list`` contains malicious elements (not numbers). Note that this question is the same question as one that was asked in the fifth session, except that we now expect you to solve it in a recursive way. The use of ``while`` and ``for`` loops will be prohibited to ensure you provide a recursive solution. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>
fr: La méthode ``sum(list)`` retourne la somme des éléments contenu dans la liste ``list``. Exemple: la somme de :math:`[1, 2, 3]` est :math:`6` Notez que votre algorithme devrait être capable de calculer la somme même quand la liste ``list`` contient des éléments malicieux (pas des nombres). Notez aussi que cette question est la même qu'une question demandée dans la session 5 sauf que vous devez la résoudre de manière récursive. L'utilisation de boucles ``while`` et ``for`` est interdite pour s'assurer que votre solution est bien récursive. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>

source: Session 8: Sum
fr: Session 8 : Somme

source: Provide the body of the following method: .. code-block:: python def sum(list):
fr: Donnez le corps de la méthode suivante : .. code-block:: python def sum(list):

source: The sum of {} is {} and you returned {}.
fr: La somme de {} est {} et vous avez retourné {}.

source: The sum of {} is {} and you returned {}. Do you handle floats?
fr: La somme de {} est {} et vous avez retourné {}. Gérez-vous l'utilisation des floats?

source: The sum list provided was {}. Did you take care of everything?
fr: La liste à sommer était {}. Avez-vous bien tout pris en compte?

source: When the list is empty you should return 0.
fr: Quand la liste est vide, vous devriez retourner 0.

source: Suppose the variables ``a`` and ``b`` contain a natural number. Write a code fragment that assigns the remainder of their division in the variable ``rest``. To implement your solution, use only a ``while`` loop and subtractions (the simple solution ``rest = a % b`` is not allowed; we want to test if you are capable of implementing such an operation yourself). Note that you should not allow division by 0 and assign the value ``None`` to ``rest`` if this would occur. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>
fr: Supposez que les variables ``a`` et ``b`` contiennent un nombre naturel. Ecrivez un fragment de code qui assigne le reste de leur division à la variable ``rest``. Pour implémenter votre solution, utilisez uniquement une boucle ``while`` et des soustractions (la solution la plus simple ``rest = a % b`` n'est pas acceptée; nous voulons tester si vous êtes capable d'implémenter une telle opération par vous-même). Notez que vous ne devez pas permettre la division par 0 et vous devez assigner la la valeur ``None`` à ``rest`` dans un tel cas. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>

source: Session 2: Remainder of an integer division
fr: Session 2 : Reste d'une division d'entiers

source: .. code-block:: python a = ... #variable to evaluate b = ... #variable to evaluate rest = ... #store in this variable the remainder of the division a/b
fr: .. code-block:: python a = ... #variable à évaluer b = ... #variable à évaluer rest = ... #enregistrez dans cette variable le reste de la division a/b

source: The remainder of the entire division {} / {} is {} and you returned {}.
fr: Le reste de la division entière {} / {} est {} et vous avez retourné {}.

source: The remainder of the entire division {} / {} is None and you returned {}.
fr: Le reste de la division entière {} / {} est None et vous avez retourné {}.

source: Variable assignment
fr: Assignement d'une variable

source: Pick the piece of code which will print 42.
fr: Choisissez le code qui va afficher 42.

source: In the Python language, whitespace in a variable's name is not allowed. You can compensate with: -CamelCasing: myVar -Underscores: my_var (prefered Python naming conventions)
fr: Dans le langage Python, les espaces dans un nom de variable ne sont pas acceptés. Vous pouvez le remplacer par : - l'utilisation du CamelCase : myVar - l'utilisation des underscores : my_var (le plus souvent utilisé en Python par convention)

source: You should pay attention to the name of your variable since Python is case-sensitive.
fr: Vous devriez faire attention au nom de votre variable car Python est case-sensitive (il fait la différence entre les majuscules et les minuscules).

source: While loops
fr: Boucles while

source: Which of the following code fragments calculates the sum of the first ``n`` positive integers?
fr: Lequel des fragments de code suivants calcule la somme des ``n`` premiers entiers positifs ?

source: The correct answer is not attained. Didn't you forget an iteration?
fr: La bonne réponse n'est pas atteinte. Avez-vous oublié une itération ?

source: Your loop will never end. Check your condition.
fr: Votre boucle ne se terminera jamais. Vérifiez vos conditions.

source: The indentation is an extremelly important part of coding in Python since it allows to know in which block the statement is executed. Are ``i`` and ``sum`` supposed to be assigned in a block before the loop?
fr: L'indentation est une part extrêmement importante de la programmation en Python puisque ça permet de savoir dans quel bloc l'expression est exécutée. Est-ce que ``i`` et ``sum`` sont supposés être assignés dans un bloc avant la boucle ?

source: ``While`` loops are useful when we need to repeat similar tasks multiple times. In arithmetic, the factorial of a positive integer (``n``) and greater than `1` is defined as the product of all integers less than or equal to ``n``. The factorial of ``n`` is denoted as :math:`n!`. Thus :math:`4! = 24`. Among the ``while`` loops below, which one calculates correctly :math:`n!` ?
fr: Les boucles ``while`` sont utiles quand on a besoin de répéter une tâche similaire plusieurs fois. En arithmétique, la factorielle d'un entier positif (``n``) et plus grand que `1` est défini comme le produit de tous les entiers plus petits que ou égaux à ``n``. La factorielle de ``n`` est dénotée comme :math:`n!`. Donc :math:`4! = 24`. Parmi les boucles ``while`` ci-dessous, laquelle calcule correctement :math:`n!` ?

source: Will your loop stop in other case than `1`?
fr: Est-ce que votre boucle s'arrête dans d'autres cas que `1` ?

source: Pretty sure you calculated the factorial of `n-1` .
fr: Vous avez très probablement calculé la factorielle de `n-1`.

source: Python syntax
fr: Syntaxe python

source: Which of the following program fragments respects the syntax and semantics of the language?
fr: Lequel des fragments de programme suivants respecte la syntaxe et la sémantique du langage ?

source: The indentation is an extremelly important part of coding in Python since it allows to know in which block the statement is executed. In this case your program will meet an unexpected indentation.
fr: L'indentation est une part extrêmement importante de la programmation en Python puisque ça permet de savoir dans quel bloc l'expression est exécutée. Ici, votre programme va rencontrer une indentation inattendue.

source: Since there is no type in Python a variable can contain as well an integer as text. test would be print with this code fragment.
fr: Comme il n'y a pas de types en Python, une variable peut contenir autant un entier qu'un texte. test serait affiché avec ce fragment de code.

source: Comments in Python
fr: Commentaires en Python

source: Check the snippets which contain a valid comment.
fr: Sélectionnez l'extrait qui contient des commentaires valides.
