Repository: Maxime2702/INGInious
Catalog: LSINF1101_adaptive/$common/student/$i18n/*.po
Languages: fr

source: In mathematics, the factorial of a strictly positive integer ``x``, denoted as :math:`x!` is the product of all strictly positive integers less than or equal to ``x``. The factorial of 0 is defined as 1. Calculate the factorial of an integer ``x`` and store the computed value in the variable ``result``. *Examples*: * :math:`5! = 5 × 4 × 3 × 2 × 1 = 120` * :math:`0! = 1` .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>
fr: En mathématiques, la factorielle d'un entier strictement positif ``x``, noté :math:`x!`est le produit de tous les entiers strictement positifs plus petits ou égaux à ``x``. La factorielle de 0 est 1. Calculez la factorielle d'un entier ``x`` et enregistrez la valeur calculée dans la variable ``result``. *Exemples*: * :math:`5! = 5 × 4 × 3 × 2 × 1 = 120` * :math:`0! = 1` .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>

source: Session 1: Factorial
fr: Session 1 : Factorielle

source: .. code-block:: python x = ... #the number result = ... #store in this variable the factorial of x
fr: .. code-block:: python x = ... #le nombre result = ... #enregistre dans cette variable la factorielle de x

source: The factorial of the integer {} is {} and you returned {}.
fr: La factorielle de l'entier {} est {} et vous avez retourné {}.

source: The factorial of 0 is 1 and you returned {}.
fr: La factorielle de 0 est 1 est vous avez retourné.

source: In mathematics, the `Fibonacci series <https://en.wikipedia.org/wiki/Fibonacci_number>`_ are the numbers in the following sequence of integers, which is characterized by the fact that every number after the first two is the sum of the two preceding ones: /*Example*: :math:`0, 1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89, 144, ...` A very simple algorithm would be: $$\\text{F}_0 = 0$$ $$\\text{F}_1 = 1$$ $$\\text{F}_n = \\text{F}_{n-1} + \\text{F}_{n-2}$$ Create a function ``fibonacci(n)`` that returns the nth element of the Fibonacci sequence. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>
fr: En mathématiques, la `suite de Fibonacci <https://fr.wikipedia.org/wiki/Suite_de_Fibonacci>`_ sont les nombres dans la séquence suivante d'entiers, qui est caractérisée par le fait que chaque nombre après les deux premiers est égal à la somme des deux précédents : /*Exemple*: :math:`0, 1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89, 144, ...` Un algorithme très simple serait : $$\\text{F}_0 = 0$$ $$\\text{F}_1 = 1$$ $$\\text{F}_n = \\text{F}_{n-1} + \\text{F}_{n-2}$$ Créez une fonction ``fibonacci(n)`` qui retourne le Nième élément de la suite de Fibonacci. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>

source: Implement the function ``fibonacci(n)`` in Python.
fr: Implémentez la fonction ``fibonacci(n)`` en Python.

source: The {}th fibonacci number is {} and you returned {}.
fr: Le {}ème nombre de Fibonacci est {} et vous avez retourné {}.

source: For 0 the fibonacci number is 0 and you returned {}.
fr: Pour 0 le nombre de Fibonacci est 0 et vous avez retourné {}.

source: For 1 the fibonacci number is 1 and you returned {}.
fr: Pour 1 le nombre de Fibonacci est 1 et vous avez retourné {}.

source: In programming, one of the first exercise asked for practice is to calculate the sum of the ``n`` first positive integers. It is to illustrate the capacity to repeat a process easily and with a few lines of computers. To do so, use a ``for`` loop with a range. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>
fr: En programmation, l'un des premiers exercices demander en pratique est de calculer la somme des ``n`` premiers entiers positifs. C'est pour illustrer la capacité de répétition d'un processus facilement avec quelques lignes de code. Pour cela, utilisez une boucle ``for``. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>

source: Session 1: Sum
fr: Session 1 : Somme

source: .. code-block:: python x = ... #the number result = ... #store in this variable the sum of the x first positive integers
fr: .. code-block:: python x = ... #le nombre result = ... #enregistre dans la variable la somme des c premiers entiers positifs

source: The sum of the {} first integers is {} and you returned {}.
fr: La somme des {} premiers entiers positifs est {} et vous avez retourné {}.

source: Write a program allowing to play the game `fizzbuzz <https://en.wikipedia.org/wiki/Fizz_buzz>`_. You receive a number (stored in variable ``i``). We will implement a simplified version of the game. For a given integer ``i``, the game will : - Store the string "``fizz``" in the variable ``temp`` if the number is divisible by 3. - Store the string "``buzz``" in the variable ``temp`` if the number is divisible by 5. - Store the string "``fizzbuzz``" in the variable ``temp`` if the number is divisible by 3 and by 5. - Store the string "``no``" in the variable ``temp`` if the number is not divisible by 3 nor by 5. .. code-block:: python i = ... # the number to check (i >= 1) temp = ... # "fizz", "buzz", "fizzbuzz" or "no" depending on i's value .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>
fr: Ecrivez un programme qui permet de jouer au jeu `fizzbuzz <https://en.wikipedia.org/wiki/Fizz_buzz>`_. Vous recevez un nombre (stocké dans la variable ``i``). Nous allons implémenter une version simplifiée du jeu. Pour un entier ``i`` donné, le jeu va : - enregistre la string "``fizz``" dans la variable ``temp`` si le nombre est divisible par 3. - enregistre la string "``buzz``" dans la variable ``temp`` si le nombre est divisible par 5. - enregistre la string "``fizzbuzz``" dans la variable ``temp`` si le nombre est divisible par 3 et par 5. - enregistre la string "``no``" dans la variable ``temp`` si le nombre n'est divisible ni par 3, ni par 5. .. code-block:: python i = ... # le nombre à tester (i >= 1) temp = ... # "fizz", "buzz", "fizzbuzz" ou "no" en fonction de la valeur de i .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>

source: ``i`` is provided and you need to store the adequate return value in ``temp``
fr: ``i`` est donné et vous devez enregistrer la valeur de retour adéquate dans ``temp``

source: With {} as input the program should return {} and you returned {}.
fr: Avec {} comme entrée, le programme devrait retourner {} et vous avez retourné {}.

source: In Python, we can store many kinds of elements in a list, including lists themselves. *Example*: :math:`[1,[2, 3], 4,[5, [6, 7]], 8]` Such structures are hard to read for a program, however, and often need to be flattened to a simple one-level depth list before. The flattened version of the list above would be: :math:`[1, 2, 3, 4, 5, 6, 7, 8]` Create a function ``flatten(l)`` that returns a one-level depth list from a multi-level depth list. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>
fr: En Python, on peut enregistrer beaucoup de sortes d'éléments dans une liste, y compris des listes elle-mêmes. *Exemple*: :math:`[1,[2, 3], 4,[5, [6, 7]], 8]` De telles structures sont cependant difficiles à lire pour un programme, et souvent, elles ont besoin d'être aplatie en une simple liste à un seul niveau pour ce faire. La version aplatie de la liste ci-dessus serait : :math:`[1, 2, 3, 4, 5, 6, 7, 8]` Créez une fonction ``flatten(l)`` qui retourne une liste d'un niveau de profondeur à partir d'une liste à plusieurs niveaux. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>

source: Session 8: Flatten
fr: Session 8 : Listes Aplaties

source: Implement the function ``flatten(l)`` in Python.
fr: Implémentez la fonction ``flatten(l)`` en Python.

source: The flatten version of {} is {} and you returned {}. You should watch you behaviour in case of empty lists.
fr: La version aplatie de {} est {} et vous avez retourné {}. Vous devriez vérifier le comportement de votre code dans le cas des listes vides.

source: The Greatest Common Divisor of two natural numbers ``a`` and ``b`` is the biggest natural number ``k`` such that the division of ``a`` and ``b`` by this natural ``k`` is an entire division. Euclid found a very simple recursive algorithm to find the GCD of two numbers: $$\\text{gcd}(a,0) = a$$ $$\\text{gcd}(a,b) = \\text{gcd}(b,a\\%b)$$ Recall that the operator ``%`` returns the remainder of the euclidian division. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>
fr: Le Plus Grand Commun Diviseur (Greatest Common Divisor en anglais) de deux nombres naturels ``a`` et ``b`` est le plus grand nombre naturel ``k`` tel que la division de ``a`` et ``b`` par ce naturel ``k`` est une division entière. Euclide a trouvé un algorithme récursif très simple pour trouver le PGCD de deux nombres : $$\\text{gcd}(a,0) = a$$ $$\\text{gcd}(a,b) = \\text{gcd}(b,a\\%b)$$ Rappelez-vous que l'opérateur ``%`` retourne le reste de la division euclidienne. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>

source: Session 3: Greatest common divisor
fr: Session 3 : Plus Grand Commun Diviseur

source: Implement the function ``gcd(a,b)`` in Python.
fr: Implémentez la fonction ``gcd(a,b)`` en Python.

source: Test zero - The greatest common divisor between {} and {} is {} and you returned {}.
fr: Test zero - Le plus grand commun diviseur entre {} et {} est {} et vous avez retourné {}.

source: The greatest common divisor between {} and {} is {} and you returned {}.
fr: Le plus grand commun diviseur entre {} et {} est et vous avez retourné {}.

source: The Greatest Divisor of a number ``a`` is the biggest number ( except ``a`` itself) such that the division of ``a`` by this natural is an entire division. Since \\(0\\) is divisible by any natural this may cause some problems if you will look for the bigger one, so we expect you to return ``None``. \\(1\\) shall also return ``None``. Recall that the operator ``%`` returns the remainder of the Euclidian division. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>
fr: Le Plus Grand Diviseur d'un nombre ``a`` est le plus grand nombre (excepté ``a`` lui-même) tel que la division de ``a`` parce ce nombre naturel est une division entière. Etant donné que \\(0\\) est divisible par n'importe quel nombre naturel, cela risque de poser problème pour retourner le plus grand, nous attendons donc que vous retourniez ``None`` dans ce cas. \\(1\\) devrait également renvoyer ``None``. Rappelez-vous que l'opérateur ``%`` retourne le reste de la division euclidienne. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>

source: Session 3: Greatest divisor
fr: Session 3 : Plus Grand Diviseur

source: Provide the body of the following method: .. code-block:: python def greatest_divisor(a):
fr: Donnez le corps de la méthode suivante : .. code-block:: python def greatest_divisor(a):

source: The greatest divisor of {} is {} and you returned {}.
fr: Le plus grand diviseur de {} est {} et vous avez retourné {}.

source: The expected answer for the greatest divisor of 0 should be None and you returned {}.
fr: La réponse attendue pour le plus grand diviseur de 0 devrait être None et vous avez retourné {}.

source: As a good student of this course, you want to level up a little bit your skills in programming and decided to try and create a *Graphical User Interface* (*GUI*). Specifically, you will create a class that represents a **clickable button** that can be added on a screen. Buttons should have: * a **width** (in pixel) * a **height** (in pixel) * a **label** (what is written on the button) * a **callback function** (the function called when the button is clicked) They should also have a method to "*stringify*" the instance of the button, that is, return a **description of the button as a string**. For example, a button 200px wide, 50px high, with the label "Click me!" and a callback called "explode_kittens" would stringify to `"Button { size:(200,50), label:'Click me!', callback:'explode_kittens' }"`. *Note: the canonical way to call a function that returns a string description of an object in Python is the following:* .. code-block:: python class Example: def __str__(): # Stringify method return "description" .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>
fr: En tant que bon étudiant de ce cours, vous voulez améliorer vos compétences en programmation et vous décidez d'essayer de créer une *interface graphique* (Graphical User Interface en anglais, *GUI* pour faire court). Plus précisément, vous créerez une classe qui représente un **bouton** qui peut être ajouté à l'écran. Les boutons devraient avoir : * une largeur (**width**) exprimée en pixels * une hauteur(**height** ) exprimée en pixels * un **label** représentant ce qui est écrit sur le bouton * une fonction de rappel (**callback**) représentant la fonction appelée quand le bouton est cliqué Ils devraient aussi avoir une méthode pour convertir l'instance bouton en une chaine de caractères, c'est-à-dire, retourner une **descriptiondu bouton comme une chaine de caractère**. Par exemple, un bouton de 200px de large, 50px de haut et ayant le label "Click me!" et une fonction de rappel nommée "explode_kittens" serait convertie en `"Bouton { size:(200,50), label:'Click me!', callback:'explode_kittens' }"`. *Note : par convention, en Python, on nomme les fonction retournant une string pour décrire un objet comme suit :* .. code-block:: python class Example: def __str__(): # méthode de conversion return "description" .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>

source: Session 9: GUI button
fr: Session 9 : Bouton GUI

source: Provide the implementation of the class ``Button`` with the following **attributes**: * ``size``: a tuple *(<width>, <height>)* * ``label``: a string * ``callback``: a function and with the following **methods**: * a constructor which takes as arguments a tuple with 2 positive integers as the size, a string as the label and a function as the callback * ``__str__()``: returns a string description of the current instance * ``set_size(new_size)``: changes the size to a new tuple with two positive integers * ``set_label(new_label)``: changes the label to a new string * ``on_click(new_callback)``: changes the callback to a new function (you don't need to check the number of parameters of the function) * ``clicked()``: calls the callback function You should raise an ``ValueError`` if you get an **invalid argument** to a method. *Note (1): you can test whether a variable contains a function, you can use the function ``callable(var)`` which returns ``True`` if ``var`` contains a function.* *Note (2): you can get the name of a function (stored in a variable or not) using their attribute ``__name__``. For example:* .. code-block:: python def fn(): pass var = fn print(fn.__name__) # prints "fn" print(var.__name__) # prints "fn"
fr: Donnez l'implémentation de la classe ``Button`` avec les **attributs** suivants : * ``size``: un tuple *(<width>, <height>)* * ``label``: une chaine de caractère * ``callback``: une fonction et avec les **méthodes** suivantes : * un constructeur prenant en argumets un tuple avec deux entiers positifs comme size, une string comme label et une fonction comme callback. * ``__str__()``: retourne une chaine de caractère décrivant l'instance courante * ``set_size(new_size)``: change la taille par un nouveau tuple constitué de deux entiers positifs * ``set_label(new_label)``: change le label par une nouvelle chaine de caractère * ``on_click(new_callback)``: change le callback par une nouvelle fonction (vous ne devez pas vérifier le nombre de paramètres de la fonction) * ``clicked()``: appelle la fonction callback Vous devez lever une ``ValueError`` si vous recevez un **argument invalide** pour une méthode. *Note (1) : vous pouvez tester si une variable contient une fonction, vous pouvez utiliser la fonction ``callable(var)`` qui retourne ``True`` si ``var``contient une fonction.* *Note (2) : vous pouvez obtenir le nom d'une fonction (enregistré dans une variable ou non) en utilisant leur attribut ``__name__``. Par exemple :* .. code-block:: python def fn(): pass var = fn print(fn.__name__) # affiche "fn" print(var.__name__) # affiche "fn"

source: Does the class `Button` exist?
fr: Est-ce que la classe `Button` existe?

source: You wrongly raised an exception when creating a button: {}('{}')
fr: Vous avez levé une exception alors qu'il ne fallait pas en créant le bouton : {}('{}')

source: Your button does not have an attribute called 'size'.
fr: Votre bouton n'a pas d'attribut appelé 'size'.

source: Your button does not have an attribute called 'label'.
fr: Votre bouton n'a pas d'attribut appelé 'label'.

source: Your button does not have an attribute called 'callback'.
fr: Votre bouton n'a pas d'attribut appelé 'callback'.

source: You wrongly raise an exception when creating a button with size {}, label '{}' and a valid callback: {}('{}').
fr: Vous avez levé une exception alors que ce n'était pas nécessaire en créant un bouton de taille {}, label '{}' et un callback valide : {}('{}').

source: You raise an unexpected exception when creating a button with invalid size {} and valid label and callback: {}('{}').
fr: Vous avez levé une exception alors que ce n'était pas nécessaire en créant un bouton avec une taille (size) invalide {} et un label et un callback valides : {} ('{}')
