Repository: Maxime2702/INGInious
Catalog: LSINF1101_adaptive/$common/student/$i18n/*.po
Languages: fr

source: Memoization refers to remembering results of method calls based on the method inputs and then returning the remembered result rather than computing the result again. You can think of it as a cache for method results. The use of this practice will enable you to boost the speed of yout programs when you need to call a function with the same parameters multiple times. You will now implement a function that will store the calls of a function in a dedicated dictionnary and use it in later calls. Note that besides the ``memoization`` function, you should also implement the methods ``factorial`` and ``fibonacci`` able to make use of the memoization principle. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>
fr: La memoization désigne le rappel de résultats d'appels de méthode basé sur les entrées de la méthode et en retournant le résultat remémoré plutôt que de le calculer à nouveau. Vous pouvez voir ça comme un cache pour les résultats d'une méthode. L'utilisation de cette pratique vous permettra de booster la vitesse de vos programmes quand vous aurez besoin d'appeler une fonction avec les mêmes paramètres plusieurs fois. Vous allez implémenter une fonction qui enregistrera les appels d'une fonction dans un dictionnaire dédié à ça et vous l'utiliserez plus tard. Notez qu'en plus de la fonction ``memoization``, vous devrez aussi implémenter les méthodes ``factorial`` et ``fibonacci`` capables d'utiliser le principe de memoization. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>

source: Memoization implementation
fr: Implémentation de memoization

source: Implement the function ``memoization(fun, n)`` in Python. With ``fun`` as the function on which the memoization will be used and ``n`` the argument of the function. A dictionnary ``mapping`` is provided and should be used to map each function to its corresponding dictionnary. Note that the dictionaries have not yet enough entries to pass the tests. .. code-block:: python mapping = {fibonacci: fibo, factorial: fact, ...}
fr: Implémentez la fonction ``memoization(fun, n)`` en Python. Avec ``fun`` comme fonction sur laquelle la memoization sera utilisée et ``n`` l'argument de la fonction. Un dictionnaire ``mapping`` est fourni et devrait être utilisé pour associer chaque fonction avec le dictionnaire correspondant. Notez que les dictionnaires n'ont pas encore assez d'entrées pour passer les tests. .. code-block:: python mapping = {fibonacci: fibo, factorial: fact, ...}

source: Fibonacci implementation
fr: Implémentation de Fibonacci

source: Implement a function ``fibonacci(n)`` in Python which will be used by and use ``memoization``.
fr: Implémentez une fonction``fibonacci(n)`` en Python qui va être utilisée par et pour la ``memoization``.

source: Factorial implementation
fr: Implémentation de la factorielle

source: Implement a function ``factorial(n)`` in Python which will be used by and use ``memoization``.
fr: Implémentez une fonction ``factorial(n)`` en Python qui utilisera et sera utilisé par la ``memoization``.

source: The sum of the {}th first numbers is {} and you returned {}. Your memoization algorithm seem to not support other functions.
fr: La somme de {} premiers nombres est {} et vous avez retourné {}. Votre algorithme de memoization semble ne pas supporter les autres fonctions.

source: The factorial of {} is {} and you returned {}.
fr: La factorielle de {} est {} et vous avez retourné {}.

source: It seems that you didn't use the memoization properly.
fr: Il semblerait que vous n'ayez pas utilisé la memoization comme il faut.

source: You are part of the organisation of the **5 and 10 miles** in Louvain-la-Neuve. But the system went down just before the start. There were two student to take note of the arrival of the runners. Happily, there were two lines to count, your job is to get one list of the two, to have a general ranking. The lists you'll receive are a succession of ``['name', time]`` with the time in increasing order. Create a fonction ``merge(first_list, second_list)`` that will return one list wich has the elements of the 2 lists in order. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>
fr: Vous faites partie de l'organisation des **5 et 10 miles** de Louvain-la-Neuve. Mais le système est tombé en panne juste avant le départ. Il y avait deux étudiants pour prendre note des arrivées des coureurs. Heureusement, il n'y avait que deux lignes à compter. Votre job consiste à faire une liste de ces deux listes pour avoir un classement général. Les listes que vous recevez sont une succession de ``['name', time]`` avec le temps dans un ordre croissant. Créez une fonction ``merge(first_list, second_list)`` qui retournera une liste qui a les éléments des deux listes dans l'ordre. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script> .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>

source: Session 5: Lists merging
fr: Session 5 : Fusion de listes

source: Provide the body of the following method .. code-block:: python def merge(first_list, second_list):
fr: Donnez le corps de la méthode suivante : .. code-block:: python def merge(first_list, second_list):

source: The lists may be empty.
fr: Les listes peuvent être vides.

source: One list may be empty.
fr: Une liste peut être vide.

source: The two lists are {} and {} and you returned {}.
fr: Les deux listes sont {} et {} et vous avez retourné {}.

source: Suppose the variables ``a``, ``b`` and ``c`` contain a natural number. Write a code fragment that assigns to the variable ``min`` the smallest of these numbers. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>
fr: Supposez que les variables ``a``, ``b`` et ``c`` contiennent un nombre naturel. Ecrire un fragment de code qui assigne à la variable ``min`` le plus petit de ces nombres. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>

source: .. code-block:: python a = ... #variable to evaluate b = ... #variable to evaluate c = ... #variable to evaluate minima = ... #store in this variable the smallest of the three variables
fr: .. code-block:: python a = ... #variable à évaluer b = ... #variable à évaluer c = ... #variable à évaluer minima = ... #enregistrea dans cette variable la valeur la plus petite des trois

source: The minimum of {} is {} and you returned {}.
fr: Le minimum de {} est {} et vous avez retourné {}.

source: After the third world war, the planet is now in a post-apocalyptic state. You're one of the only survivors and are looking for a bit of fellowship. But you can't exactly swipe tinder since most of the network is down. Fortunately your best friend is with you... Your computer (Yes, that's lame)! With its help you'll be able to reach the rest of the world. Since you've got a `Morse <https://en.wikipedia.org/wiki/Morse_code>`_ dictionnay stored on your computer (Matt Damon did have an ASCII table in "Alone on Mars" it's not so incongruous) you'll use it to translate your text and emit it through an old citizen band radio. Note that if you should try to translate any unregistered character, you should raise a ``TypeError`` exception. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>
fr: Après la troisième guerre mondiale, la planète est laissée dans un état post-apocalyptique. Vous êtes l'un des seuls survivants et vous cherchez un peu de compagnie. Mais vous ne pouvez pas trop swiper sur Tinder vu que le réseau est mort.. Heureusement votre meilleur ami est avec vous... Votre ordinateur (oui, ça craint!) Avec son aide, aide vous allez pouvoir entrer en contact avec le reste du monde. Puisque vous avez un dictionnaire `Morse <https://fr.wikipedia.org/wiki/Code_Morse_international>`_ enregistré sur votre machine (Matt Damon avait bien une table ASCII avec lui dans "Seul sur Mars" , donc c'est pas si absurde), vous allez l'utiliser pour traduire votre texte et l'émettre grâce à une vieille radio. Notez que si vous devez essayer de traduire un caractère non-enregistré, vous devez lever une exception ``TypeError``. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>

source: Session 7: Apocalypse - Morse translation
fr: Session 7 : Apocalypse - Traduction en Morse

source: Implement the function ``translate(data)`` in Python. With ``data`` as the string you wish to encode in Morse and a dictionnary ``morse`` usable to do the translations. .. code-block:: python morse = { "A" : ".-", "B" : "-...", "C" : "-.-.", "D" : "-..", "E" : ".", ... }
fr: Implémentez la fonction ``translate(data)`` en Python. Avec ``data`` comme chaine de caractère que vous voulez encoder en Morse et un dictionnaire ``morse`` utile pour faire les traductions. .. code-block:: python morse = { "A" : ".-", "B" : "-...", "C" : "-.-.", "D" : "-..", "E" : ".", ... }

source: The representation of {} in Morse is {} and you returned {}. You did not use the given dictionary.
fr: La représentationde {} en Morse est {} et vous avez retourné {}. Vous n'avez pas utilisé le dictionnaire donné.

source: The representation of {} in Morse is {} and you returned {}.
fr: La représentation de {} en Morse est {} et vous avez retourné {}.

source: {} should have raised an error due to lowercase elements but did not.
fr: {} aurait du lever une exception à cause des lettres minuscules mais ne l'a pas fait.

source: `Anonymous <https://en.wikipedia.org/wiki/Anonymous_(group)>`_ just hired you on the dark web for a dangerous task. They've been trying to crack a code for a few days but didn't achieve anything... yet! They want you to build a function that will analyze each character in a given code and determine its nature. The goal is simple, they intend to use the information you will provide to look for a pattern in the code. Create a function ``extract(code)`` to provide information regarding the nature of each element of the code: For example, when given the code ``'AeB7'`` as input the function should produce ``'vowel-up vowel-low consonant-up number'`` as output. In general : * Add ``number`` to the answer if the element of the code is a digit. * Add ``vowel`` to the answer if the element of the code is a vowel. * Add ``consonant`` to the answer if the element of the code is a consonant. * Follow it by ``-up`` if the vowel or consonant is in upper case. * Follow it by ``-low`` if the vowel or consonant is in lower case. *Example*: With the code ``'65AeBc7'`` the function would output ``number number vowel-up vowel-low consonant-up consonant-up number``. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>
fr: `Anonymous <https://fr.wikipedia.org/wiki/Anonymous_(collectif)>`_ vient de vous engager sur le dark web pour une tâche dangereuse. Ils essayent de craquer un code depuis quelques jours mais ne sont arrivés à rien... pour le moment! Ils veulent que vous construisiez une fonction qui analysera chaque caractère dans un code donné et que vous déterminiez sa nature. Le but est simple : ils ont l'intention d'utiliser les informations que vous leur fournirez pour trouver un pattern dans le code. Créez une fonction ``extract(code)`` pour fournir des infos concernant la nature de chaque élément du code : Par exemple, si le code ``'AeB7'`` est donné en entrée, la fonction devrait produire ``'vowel-up vowel-low consonant-up number'`` comme sortie. En général : * Ajoutez un ``number`` à la réponse si l'élément du code est un chiffre. * Ajoutez un ``vowel`` à la réponse si l'élément du code est une voyelle. * Ajoutez un ``consonant`` à la réponse si l'élément du code est une consonne. * Suivez cela par ``-up`` si la voyelle/consonne est en majuscule. * Suivez cela par ``-low`` si la voyelle/consonne est en minuscule. *Exemple* : Avec le code ``'65AeBc7'`` la fonction devrait sortir ``number number vowel-up vowel-low consonant-up consonant-up number`` .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>

source: Session 4: Anonymous - Information extraction
fr: Session 4 - Anonymous - Extraction d'informations

source: Implement the function ``extract(code)`` in Python.
fr: Implémentez la fonction ``extract(code)`` en Python.

source: The natures of {} is {} and you returned {}.
fr: La nature de {} est {} et vous avez retourné {}.

source: Since your work was quite remarkable, `Anonymous <https://en.wikipedia.org/wiki/Anonymous_(group)>`_ contacted you again with another dangerous task. They're short-handed and would like you to treat the data you've been providing them. They want you to build a a function that will transform your precedent ouput into something easier and quickier to process. It is up to you to transform the data into an usable pattern! Create a function ``treatment(data)`` to transform the data you previously returned into a pattern: Each suite of common elements should be indicated by the nature of the element followed by '*' and its occurence without other elements in between. *Example*: With the code ``'66AeB7'`` your precedent function would output 'number number vowel-up vowel-low consonant-up number'. With this output as input ``treatment`` would output the string 'number*2 vowel-up*1 vowel-low*1 consonant-up*1 number*1' Do not hesitate to use as many submethods as you judge necessary. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>
fr: Etant donné que votre travail était remarquable, `Anonymous <https://fr.wikipedia.org/wiki/Anonymous_(collectif)>`_ vous a à nouveau contacté avec une autre tâches risquée. Ils manquent de main d'oeuvre et aimeraient que traitiez les données que vous leur avez donné. Ils veulent que vous construisiez une fonction qui transformera votre précédente sortie en quelque chose de plus simple et plus rapide à traiter. C'est à vous de voir comment transformer l'information en un pattern utilisable! Créez une fonction ``treatment(data)`` pour transformer l'information que vous avez précédemment retourné en un pattern : Chaque suite d'éléments communs devrait être indiqué par la nature de l'élément suivi de '*' et le nombre d’occurrence sans autre éléments entre. *Exemple*: Avec le code ``'66AeB7'`` votre précédente fonction sortirait 'number number vowel-up vowel-low consonant-up number'. Avec cette sortie en entrée votre nouvelle fonction ``treatment`` sortirait la string suivante 'number*2 vowel-up*1 vowel-low*1 consonant-up*1 number*1' N'hésitez pas à utiliser autant de sous-méthodes que vous jugez nécessaires. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>

source: Session 4: Anonymous - Information treatment
fr: Session 4 : Anonymous - Traitement de l'information

source: Implement the function ``treatment(data)`` in Python.
fr: Implémentez la fonction ``treatment(data)`` en Python.

source: The pattern of {} is {} and you returned {}.
fr: Le pattern de {} est {} et vous avez retourné {}.

source: You should pay attention to the ending space of your answer.
fr: Vous devriez faire attention à l'espace de fin de votre réponse.

source: `Anonymous <https://en.wikipedia.org/wiki/Anonymous_(group)>`_ was dazzled by your work and decided to entrust you with the analysis of the whole bunch of data they intercepted. With the help of the two functions you already designed, you will transform each line of the data into a pattern and extract the number of occurence it can be found in the file. Create a function ``collect(data)`` to read the file extract the patterns and store them in a dictionary with their occurrences. In case of error, just raise it. *Reminder*: - ``extract(code)``: gives the nature of each element of a string. - ``treatment(code)``: transform a suite of elements into a pattern. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>
fr: `Anonymous <https://fr.wikipedia.org/wiki/Anonymous_(collectif)>`_ a été épaté par votre travail et a décidé de vous faire confiance pour l'analyse de toutes les données qu'ils ont intercepté. Avec l'aide des deux fonctions que vous avez déjà créées, vous allez transformer chaque ligne de données en un pattern et extraire le nombre d’occurrences présentes dans le fichier. Créez une fonction ``collect(data)`` pour lire le fichier, extraire les patterns et les enregistrer dans un dictionnaire avec leurs occurrences. S'il y a une erreur, levez une exception. *Rappel*: - ``extract(code)``: donne la nature de chaque élément d'une string. - ``treatment(code)``: transforme une suite d'éléments en un pattern. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>

source: Session 7: Anonymous - Information collection
fr: Session 7 : Anonymous - Recolte d'informations

source: Implement the function ``collect(file)`` in Python.
fr: Implémentez la fonction ``collect(file)`` en Python.

source: The dictionary expected of the given file is {} and you returned {}.
fr: Le dictionnaire attendu pour le fichier donné est {} et vous avez retourné {}.
