Repository: Maxime2702/INGInious
Catalog: LSINF1101_adaptive/$common/student/$i18n/*.po
Languages: fr

source: Well tried! But you cannot use a `for` loop in this exercise. Use `while` and iterators instead.
fr: Bien essayé! Mais vous ne pouvez pas utiliser de boucle `for`dans cet exercice. Utilisez `while` et des itérateurs à la place.

source: Your code raised an exception ({}('{}')) while handling matrix {}.
fr: Votre code a levé une exception ({}('{}')) lors de la manipulation de la matrice {}.

source: With matrix {}, you computed an incorrect sum of even numbers {} instead of {}.
fr: Avec la matrice {}, vous avez calculé une somme erronée de nombres pairs {} à la place de {}.

source: Imagine you want to make a **video game** about the management of a **virtual zoo**. For this exercice, you will implement short parts of the game that represent the animals that the zoo owns, as well as the zoo. In other words, you are asked to **create a class** that will represent **any animal** and **several classes** that will represent **different species**. You are asked as well to **make a class** that will represent **the zoo itself**, containing a certain number of different animals and to create your own zoo. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>
fr: Imaginez que vous vouliez faire un **jeu vidéo** à propos du management d'un **zoo virtuel**. Pour cet exercice, vous allez implémenter de courtes parts du jeu qui représente les animaux que le zoo possède, ainsi que le zoo. En d'autres mots, on vous demande de **créer une classe** qui va représenter **n'importe quel animal** et **plusieurs classes** qui vont représenter **différentes espèces**. On vous demande aussi de **faire une classe** qui représentera **le zoo en lui-même**, contenant un certain nombre d'animaux différents et de créer votre propre zoo. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>

source: Session 10: Zoo Game
fr: Session 10 : Zoo Tycoon

source: You will first implement a class ``Animal``, which should have: * an attribute ``name`` which is the name the player will give the animal * an attribute ``diurnal`` which should be ``True`` if the animal is active at day time and ``False`` if it is active at night time * an attribute ``nb_legs`` which represents the number of legs the animal has * an attribute ``asleep`` which will be set to ``True`` (resp. ``False``) by calling the method ``sleep()`` (resp. ``wake_up()``). If the animal tries to wake up while it is not asleep or to sleep while it is already asleep, your program should raise a ``RuntimeError``. Only the **name** of the animal needs to be passed to the **constructor**. We decide to set ``asleep`` to ``False`` by default. Obviously, as this class represents any animal, we don't know what value the other attributes should take. The most logical thing to do would be to set them to ``None``. You will then implement **three different subclasses** of ``Animal`` representing three different species: ``Lion``, ``Owl`` and ``Giraffe``. The values of the different attributes of the parent class should now be set in their constructors. ``Lion`` will have an additional ``roar()`` **method**, which will print ``ROARRR!!!``. ``Owl`` will have a ``fly()`` **method**, which won't do anything (use the statement ``pass`` to do nothing). ``Giraffe`` will have an additional **attribute** ``neck_length`` (in meters). This information will be given to the constructor of the class. Note that your code shouldn't accept invalid values for this attribute (negative lengths or string values for example). Raise a ``ValueError`` in case you get an invalid value. You will then implement a **last class**: ``Zoo``, which will have a list of animals called ``animals`` as an **attribute** and a **method** ``add_animal(animal)`` to fill this list. Raise a ``ValueError`` if this method receives something else than an animal. You are finally asked to **define a function** ``create_my_zoo()`` that will return your zoo containing a lion, an owl and two giraffes. Those are your animals, name them as you want ;)
fr: Commencez par implémenter une classe ``Animal``, qui devrait avoir : * un attribut ``name`` qui est le nom que le joueur donnera à l'animal * un attribut ``diurnal`` qui doit être ``True`` si l'animal est actif pendant la journée et ``False`` s'il est actif pendant la nuit * un attribut ``nb_legs`` qui représente le nombre de pattes qu'a un animal * un attribut ``asleep`` qui sera mis à ``True`` (resp. ``False``) avec l'appel à la fonction ``sleep()`` (resp. ``wake_up()``). Si l'animal essaye de se réveiller alors qu'il n'est pas endormi ou s'il essaye de dormir alors qu'il dort déjà, votre programme devrait lever une ``RuntimeError``. Seul le **name** de l'animal doit être passé en argument au **constructeur**. Nous avons décidé de mettre ``asleep`` à ``False`` par défaut. Evidemment, comme cette classe représente n'importe quel animal, nous ne connaissons pas la valeur que les autres attributs devraient prendre. La chose la plus logique à faire serait de les mettre à ``None``. Vous implémenterez ensuite **trois sous-classes différentes** d'``Animal`` réprésentant trois espèces différentes : ``Lion``, ``Owl`` et ``Giraffe``. Les valeurs des différents attributs de la classe parent devraient maintenant être définies dans les constructeurs. ``Lion`` aura une **méthode** additionnelle ``roar()`` , qui affichera **ROARRR!!!**. ``Owl`` aura une **méthode** ``fly()``, qui ne fera rien (utilisez l'expression ``pass`` pour ne rien faire). ``Giraffe`` aura un **attribut** additionnel ``neck_length`` (en mètres). Cette information sera donnée au constructeur de la classe. Notez que votre code ne devrait pas accepter de valeurs invalides pour cet attribut (les tailles négatives ou exprimées en chaines de caractères par exemple). Levez une ``ValueError`` dans le cas où vous avez une valeur invalide. Vous implémenterez ensuite une **dernière classe** : ``Zoo``, qui aura une liste de tous les animaux appelée ``animals`` comme **attribut** et une **méthode** ``add_animal(animal)`` pour remplir cette liste. Levez une ``ValueError`` si cette méthode reçoit quelque chose d'autre qu'un animal. On vous demande enfin de **définir une fonction** ``create_my_zoo()`` qui retournera votre zoo contenant un lion, une chouette et deux girafes. Ce sont vos animaux, appelez les comme vous voulez ;)

source: Does the class `Animal` exist?
fr: Est-ce que la classe `Animal` existe ?

source: You wrongly raised an exception while creating an animal: {}('{}')
fr: Vous avez levé une exception alors que ce n'était pas nécessaire en créant un animal : {}('{}')

source: Does the class `Lion` exist?
fr: Est-ce que la classe `Lion` existe ?

source: You wrongly raised an exception while creating a lion: {}('{}')
fr: Vous avez levé une exception alors que ce n'était pas nécessaire en créant un lion : {}('{}')

source: Does the class `Owl` exist?
fr: Est-ce que la classe `Owl` existe ?

source: You wrongly raised an exception while creating an owl: {}('{}')
fr: Vous avez levé une exception alors que ce n'était pas nécessaire en créant une chouette : {}('{}')

source: Does the class `Giraffe` exist?
fr: Est-ce que la classe `Giraffe` existe ?

source: You wrongly raised an exception while creating a giraffe: {}('{}')
fr: Vous avez levé une exception alors que ce n'était pas nécessaire en créant une girafe : {}('{}')

source: Your class `Animal` does not have an attribute `name`.
fr: Votre classe `Animal` n'a pas d'attribut `name`.

source: Your class `Animal` does not have an attribute `diurnal`.
fr: Votre classe `Animal` n'a pas d'attribut `diurnal`.

source: Your class `Animal` does not have an attribute `nb_legs`.
fr: Votre classe `Animal` n'a pas d'attribut `nb_legs`.

source: Your class `Animal` does not have an attribute `asleep`.
fr: Votre classe `Animal` n'a pas d'attribut `asleep`.

source: Your class `Zoo` does not have an attribute `animals`.
fr: Votre classe `Zoo` n'a pas d'attribut `animals`.

source: Your class `Zoo` does not have a method named `add_animal`.
fr: Votre classe `Zoo` n'a pas de méthode appelée `add_animal`.

source: Does the class `create_my_zoo()` exists?
fr: Est-ce que la méthode `create_my_zoo()` existe ?

source: Does the class `Zoo` exist?
fr: Est-ce que la classe `Zoo` existe ?

source: You wrongly raised an exception while creating a zoo: {}('{}')
fr: Vous avez levé une exception alors que ce n'était pas nécessaire en créant un zoo : {}('{}')

source: The name passed to the constructor of `Animal` does not get stored in the attribute `name`.
fr: Le nom passé au constructeur d' `Animal`n'est pas enregistré dans l'attribut `name`.

source: The attribute `diurnal` of `Animal` is not set to `None` by default.
fr: L'attribut `diurnal` de `Animal` n'est pas défini à `None` par défaut.

source: The attribute `nb_legs` of `Animal` is not set to `None` by default.
fr: L'attribut `nb_legs` de `Animal` n'est pas défini à `None` par défaut.

source: The attribute `asleep` of `Animal` is not set to `False` by default.
fr: L'attribut `asleep` de `Animal` n'est pas défini à `False` par défaut.

source: The name passed to the constructor of `Animal` is not stored in the attribute `name`.
fr: Le nom passé au constructeur d'`Animal`n'est pas enregistré dans l'attribut `name`.

source: Calling ``sleep()`` on your animals doesn't set their attribute ``asleep`` to ``True``
fr: Appeler ``sleep()`` sur vos animaux ne définit pas son ``asleep`` à ``True``

source: Calling ``wake_up()`` on your animals doesn't set their attribute ``asleep`` to ``False``
fr: Appeler ``wake_up()`` sur vos animaux ne définit pas son ``asleep`` à ``False``

source: You wrongly raised an exception while creating and using an animal: {}('{}')
fr: Vous avez levé une exception alors que ce n'était pas nécessaire en créant et utilisant un animal : {}('{}')

source: Your class `Lion` is not a subclass of `Animal`.
fr: Votre classe `Lion` n'est pas une sous-classe de `Animal`.

source: The name passed to the constructor of `Lion` does not get stored in the attribute `name`.
fr: Le nom passé au constructeur de `Lion` n'est pas enregistrer dans l'attribut `name`.

source: Lions have 4 legs.
fr: Les lions ont 4 pattes.

source: Lions are active during day time
fr: Les lions sont actifs durant la journée.

source: `Lion` should be awake after its creation.
fr: `Lion` devrait être éveillé après sa création.

source: Did you make a `roar()` method in your class `Lion`?
fr: Avez-vous fait une méthode `roar()` dans votre classe `Lion`?

source: You wrongly raised an exception while creating and using a lion: {}('{}')
fr: Vous avez levé une exception alors que ce n'était pas nécessaire en créant et utilisant un lion : {}('{}')

source: Your class `Owl` is not a subclass of `Animal`.
fr: Votre classe `Owl` n'est pas une sous-classe de `Animal`.

source: The name passed to the constructor of `Owl` does not get stored in the attribute `name`.
fr: Le nom passé au constructeur de `Owl` n'est pas enregistrer dans l'attribut `name`.

source: Owls have 2 legs.
fr: Les chouettes ont deux pattes.

source: Owls are inactive during day time
fr: Les chouettes sont inactives durant la journée.

source: `Owl` should be awake after its creation.
fr: L'`Owl` devrait être éveillée après sa création.

source: Did you put a `fly()` method in your class `Owl`?
fr: Avez-vous mis une méthode `fly()` dans votre classe `Owl` ?

source: You wrongly raised an exception while creating and using an owl: {}('{}')
fr: Vous avez levé une exception alors que ce n'était pas nécessaire en créant et utilisant une chouette : {}('{}')

source: Your class `Giraffe` is not a subclass of `Animal`.
fr: Votre classe `Giraffe` n'est pas une sous-classe d'`Animal`.

source: The name passed to the constructor of `Giraffe` does not get stored in the attribute `name`.
fr: Le nom passé au constructeur de `Giraffe` n'est pas enregistrer dans l'attribut `name`.

source: Giraffes have 4 legs.
fr: Les girafes ont 4 pattes.

source: Giraffes are active during day time
fr: Les girafes sont actives durant la journée.

source: `Giraffe` should be awake after its creation.
fr: La `Giraffe`devrait être éveillée après sa création.

source: Did you add a `neck_length` attribute to your class `Giraffe`?
fr: Avez-vous ajouté un attribut `neck_length` à votre classe `Giraffe` ?

source: You wrongly raised an exception while creating and using a lion and a giraffe: {}('{}')
fr: Vous avez levé une exception alors que ce n'était pas nécessaire en créant et utilisant un lion et une girafe : {}('{}')

source: Calling `add_animal(animal)` did not add an animal in the list `animals`.
fr: Appeler `add_animal(animal)` n'a pas ajouté d'animal dans la liste `animals`.

source: Calling `add_animal(lion)` did not add a lion in the list `animals`.
fr: Appeler `add_animal(lion)` n'a pas ajouté de lion dans la liste `animals`.

source: Calling `add_animal(owl)` did not add an owl in the list `animals`.
fr: Appeler `add_animal(owl)` n'a pas ajouté de chouette dans la liste `animals`.

source: Calling `add_animal(giraffe)` did not add a giraffe in the list `animals`.
fr: Appeler `add_animal(giraffe)` n'a pas ajouté de girafe dans la liste `animals`.

source: You wrongly raised an exception while creating a zoo and adding animals: {}('{}')
fr: Vous avez levé une exception alors que ce n'était pas nécessaire en créant un zoo et ajoutant des animaux : {}('{}')

source: You wrongly raised an exception while using the function `create_my_zoo()`: {}('{}')
fr: Vous avez levé une exception alors que ce n'était pas nécessaire en utilisant ula fonction `create_my_zoo()` : {}('{}')

source: Your zoo is missing animals (you need 1 lion, 1 owl and 2 giraffes).
fr: Des animaux manquent à votre zoo (vous avez besoin d'un lion, d'une chouette, et de deux girafes).
