Repository: Maxime2702/INGInious
Catalog: LSINF1101_adaptive/$common/student/$i18n/*.po
Languages: fr

source: The comment is enclosed in a string.
fr: Le commentaire est inclus dans une string.

source: It is correct BUT don't use triple-quotes; this is for documentation strings not block comments, although it has a similar effect it is best practice to use ``#``
fr: C'est correct MAIS n'utilisez pas les triples guillemets; c'est pour la documentation pas pour les simples commentaires de blocs, même si cela à les mêmes effets c'est une meilleure pratique d'utiliser le ``#``

source: Python naming conventions
fr: Conventions de nommage en Python

source: Which of the following statements are respecting the Python naming conventions?
fr: Laquelle des expressions suivantes respecte les conventions de nommages de Python ?

source: Snake case is usually prefered regarding variables names. Although lower camel case is allowed for functions names in Python (where that's already the prevailing style).
fr: Le snake case est souvent préféré pour les noms de variables. Cependant le lower camel case est permis pour les noms de fonctions en Python (où c'est le style le plus répandu).

source: Snake case is usually prefered regarding variables names. Although screaming snake case is used for constant in Python.
fr: Le snake case est généralement préféré pour les noms de variables. Cependant le screaming snake case est utilisé pour les constantes en Python.

source: Snake case is usually prefered regarding variables names. Although upper camel case is used for class names in Python.
fr: Le snake case est généralement préféré en ce qui concerne les noms de variables. Cependant l'upper camel case est utilisé pour les noms de classe en Python.

source: Exchange variables values
fr: Echanger les valeurs de variables

source: It is often useful to be able to swap values between variables. Consider the following variables: .. code-block:: python a = 42 b = 41 Which of following code fragments swap the values correctly?
fr: C'est souvent utile de pouvoir échanger les valeurs entre les variables. Considérez les variables suivantes : .. code-block:: python a = 42 b = 41 Lequel des fragments de code suivants échange les valeurs correctement ?

source: By doing it this way you will lose the value contained in ``b`` and the value of ``a`` will be stored in the 2 variables.
fr: En faisant comme cela, vous allez perdre la valeur contenue dans ``b`` et la valeur de ``a`` sera enregistrée dans 2 variables.

source: This would work but it is more efficient and clear to do it with this little trick: .. code-block:: python a,b = b,a
fr: Ceci fonctionnerait mais ce serait plus efficace et clair de le faire avec cette petite astuce : .. code-block:: python a,b = b,a

source: Calculate min
fr: Calcul de minimum

source: Consider a program that manipulates two variables: ``a`` and ``b`` . Among the code fragments below, which one correctly stores in the variable ``min`` the minimum of the contents of the variables ``a`` and ``b`` ?
fr: Considérez un programme qui manipule deux variables : ``a`` et ``b`` . Parmi les fragments de code ci-dessous, lequel enregistre correctement dans la variable ``min`` le minimum du contenu des variables ``a`` et ``b`` ?

source: The maximum is stored in min instead of the minimum with this code.
fr: Le maximum est enregistré dans min à la place du minimum avec ce code.

source: The indentation is an extremelly important part of coding in Python since it allows to know in which block the statement is executed. What is executed in this case if the condition is verified?
fr: L'indentation est une part extrêmement importante de la programmation en Python puisque ça permet de savoir dans quel bloc l'expression est exécutée. Qu'est-ce qui est exécuté dans ce cas si la condition est vérifiée ?

source: Absolute value
fr: Valeur absolue

source: Which of these code fragments places in the variable ``abs`` the absolute value of ``x`` ?
fr: Lequel de ces fragments de code place la valeur absolue de ``x`` dans ``abs`` ?

source: What happens if ``x`` is a positive integer?
fr: Que se passe-t-il si ``x`` est un entier positif ?

source: You should consider carefully the condition used to store `-x` in ``abs`` .
fr: Vous devriez examiner attentivement la condition utilisée pour stocker `-x` dans ``abs``.

source: Intervals
fr: Intervalles

source: In mathematics, we define intervals, closed, open and semi-open. The semi-open interval :math:`[3,7[` includes all real numbers that are greater than or equal to `3` and strictly less than 7. Which of the following code fragments display ``true`` on the standard output if and only if ``x`` belongs to the interval :math:`[a, b[` ? We assume for this question that the value stored in the variable ``a`` is strictly less than the one stored in the ``b`` variable.
fr: En mathématiques, on définit des intervalles fermés, ouverts ou semi-ouverts. Les intervalles semi-ouverts :math:`[3,7[` incluent tous les nombres réels qui sont plus grands ou égaux à `3` et strictement plus petits que 7. Lequel des fragments de code suivants affiche ``true`` en sortie standard si et seulement si ``x`` appartient à l'intervalle :math:`[a, b[` ? Pour cette question, nous supposons que la valeur stockée dans la variable ``a`` est strictement plus petite que celle stockée dans la variable ``b``.

source: Is there any way for ``x`` to be between ``a`` and ``b`` with this condition?
fr: Est-il possible que ``x`` soit entre ``a`` et ``b`` avec cette condition ?

source: What happens if ``x == a`` ?
fr: Que se passe-t-il si ``x == a`` ?

source: Operators usages
fr: Usage des opérateurs

source: Which of the following code fragments prints 14?
fr: Lequel des fragments de code suivants affiche 14 ?

source: The result of the division is 14.333333334
fr: Le résultat de la division est 14.333333334

source: You cannot concatenate a string and an int.
fr: Vous ne pouvez pas concaténer une string et un entier.

source: In computer science, a sorting algorithm is an algorithm that puts the elements of a list in a certain order. The most-used orders are numerical order and lexicographical order. Efficient sorting is important for optimizing the use of other algorithms (such as search and merge algorithms) which require input data to be in sorted lists; it is also often useful for canonicalizing data and for producing human-readable output. More formally, the output must satisfy two conditions: * The output is in nondecreasing order (each element is no smaller than the previous element according to the desired total order); * The output is a permutation (reordering but with all of the original elements) of the input. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>
fr: En sciences informatiques, un algorithme de tri est un algorithme qui place les éléments d'une liste dans un certain ordre. Les ordres les plus utilisés sont l'ordre numérique et l'ordre lexicographique. Un tri efficace est important pour optimiser l'utilisation d'autres algorithmes (tels que les algorithmes de recherche ou de fusion) qui ont besoin d'une liste triée en entrée ; c'est aussi souvent utile pour la canonicalisation des données et pour produire des sorties lisibles par les humains. Plus formellement, la sortie doit satisfaire deux conditions : * La sortie est en ordre croissant (chaque élément n'est pas plus petit que l'élément précédent selon l'ordre choisi); * La sortie est une permutation (réorganisation mais avec tous les éléments originaux) de l'entrée. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>

source: Session 5: List sorting
fr: Session 5 : Tri d'une liste

source: .. code-block:: python a_list = ... #list to sort sorted_list = ... #store in this variable the sorted version of the list
fr: .. code-block:: python a_list = ... #liste à trier sorted_list = ... #enregistrez dans cette variable la version triée de la liste

source: Nice try! But using the predefined 'sort' function is a bit of cheating. Try to implement an actual algorithm for sorting the list.
fr: Bien essayé! Mais utiliser la fonction prédéfinie 'sort', c'est un peu tricher. Essayez d'implémenter un véritable algorithme pour trier la liste.

source: The sorted version of {} is {} and you returned {}.
fr: La version triée de {} est {} et vous avez retourné {}.

source: Nice try! But 'sorted' has been disabled for list objects. Please write an actual algorithm sorting the list.
fr: Bien essayé! Mais 'sorted' a été désactivé pour les objets listes. Ecrivez un véritable algorithme pour trier la liste.

source: The police is hiring you to develop a program to calculate the fine that a car driver will have to pay in the event of a violation. The law stipulates that the driver will have to pay 5 euros per km/h above the maximum authorized speed, with a **minimum fine of 12.5€**. For any speeding of **more than 10 km/h** above the authorized speed, the fine is **DOUBLED**! Your program takes as input the maximum allowed speed and the actual speed of the car. It calculates the possible fine. *Example*: - If the maximum speed is 50km/h and the vehicle is traveling at 62km/h, the penalty will be 12 * 5 * 2 = 120€. - If the maximum speed is 50km/h and the vehicle is traveling at 56km/h, the penalty will be 6 * 5 = 30€. - If the maximum speed is 50km/h and the vehicle is traveling at 51km/h, the fine will be 12.5€. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>
fr: La police vous engage pour développer un programme qui calcule les amendes qu'un conducteur doit payer s'il a fait une infraction. La loi stipule qui le conducteur doit payer 5 € par km/h au dessus de la limite de vitesse autorisée, avec une **amende minimum de 12.5 €**. Pour tous les excès de vitesse de **plus de 10 km/h** au dessus de la limite, l'amende est **DOUBLEE** ! Votre programme prend en entrée la vitesse maximale autorisée et la vitesse actuelle de la voiture et calcule l'amende possible. *Exemple*: - Si la vitesse maximale est de 50km/h et que le véhicule circule à du 62km/h, la peine sera de 12 * 5 * 2 = 120 €. - Si la vitesse maximale est de 50km/h et que le véhicule circule à du 56km/h, la peine sera de 6 * 5 = 30 €. - Si la vitesse maximale est de 50km/h et que le véhicule circule à du 51km/h, la peine sera de 12.5 €. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>

source: Session 3: Speeding fine
fr: Session 3 : Amende pour excès de vitesse

source: Implement the function ``fine(authorized_speed, actual_speed)`` in Python.
fr: Implémentez la fonction ``fine(authorized_speed, actual_speed)`` en Python.

source: The speed fine for a speed of {} instead of {} is {} and you returned {}.
fr: L'amende pour excès de vitesse pour une vitesse de {} à la place de {} est de {} et vous avez retourné {}.

source: In this exercise, you're asked to provide a class *Student*. The students are supposed to have the following characteristics: * A first name * A surname * A birth date * An email address * A student number (different for every student and given at the creation of the object, the first one should be 0 and you should use a class' variable) The object, when cast as a **string** should return for example: Student number **0**: **Hervé** **Ducobu** born the **1st of april**, can be reached at **doNotReachMeForHomeworks@gmail.com** To do so you're invited to use the magic methods. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>
fr: Dans cet exercice, il vous est demandé de donner une classe *Student*. Les étudiants sont censés avoir les caractéristiques suivantes : * Un prénom * Un surnom * Une date de naissance * Une adresse mail * Un numéro d'identification (différent pour tous les étudiants et donné à la création de l'objet, le premier commence à 0 et devrait être une variable de classe) L'objet, quand casté en tant que **string** devrait retourner par exemple : Student number **0**: **Hervé** **Ducobu** born the **1st of april**, can be reached at **doNotReachMeForHomeworks@gmail.com** Pour cela vous êtes invités à utiliser les méthodes magiques. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>

source: Implement the class ``Student`` in Python. We will create the object with: *stu = Student('firstname', 'surname', 'birthday', 'email')*
fr: Implémentez la classe ``Student`` en Python. Nous allons créer l'objet avec : *stu = Student('firstname', 'surname', 'birthday', 'email')*

source: With the following data: {}, {}, {}, {} for the student created, you returned {} instead of {}
fr: Avec les données suivantes : {}, {}, {}, {} pour l'étudiant créé, vous avez retourné {} à la place de {}

source: With the following data: {}, {}, {}, {} for the {}th student created, you returned {} instead of {}
fr: Avec les données suivantes : {}, {}, {}, {} pour le {}ème étudiant créé, vous avez retourné {} à la place de {}

source: The method ``sum(list)`` returns the sum of the elements contained in ``list``. Example: the sum of :math:`[1, 2, 3]` is :math:`6` Note that your algorithm should be able to compute the sum even when the list ``list`` contains malicious elements (not numbers). .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>
fr: La méthode ``sum(list)`` retourne la somme des éléments contenus dans ``list``. Exemple: la somme de :math:`[1, 2, 3]` est :math:`6` Notez que votre algorithme devrait être capable de calculer la somme même si la liste ``list`` contient des éléments malicieux (pas des nombres). .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>

source: Session 4: Sum
fr: Session 4 : Somme

source: The sum list provided was {}. The type() method may be able to help you.
fr: La liste à sommer était {}. La méthode type() pourra peut-être vous aider.

source: Your citizen band radio tinder worked quite well and you're now able to speak with a lot of interesting people. Even more interesting, a wonderfull creature just contacted you and achieved to send you an image through points and spaces (God bless Morse code). You definitely want to speak with her and other future matchs but it occured to you that you didn't study foreign language well enough. Fortunately you've got dictionnaries in your computer (which apparently had downloaded the whole internet). You know just have to code a translator! Note that if the word you're looking to translate isn't registered in your dictionnary, you should let the word in its original language. *Example*: - "I'm fond of Dean" would become in french with the dictionnary ``fr``: "je suis amoureux de doyen" Note that we do not excpect you to provide an exact translation but a word to word one. Moreover the keys are stored in lowercase in the dictionnaries. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>
fr: Votre tinder par radio a bien fonctionné et vous pouvez désormais discuter avec beaucoup de gens intéressants. Encore plus intéressant, une merveilleuse créature vient de vous contacter et est parvenue à vous envoyer une image à travers des points et des espaces (Dieu bénisse le code Morse). Vous voulez vraiment lui parler ainsi qu'à vos autres futurs matchs mais vous venez de réaliser que vous n'avez jamais bien étudier les langues étrangères. Heureusement, vous avez des dictionnaires sur votre ordinateur (qui a apparemment téléchargé l'entierté d'internet). Vous devez simplement coder un traducteur! Notez que si un mot que vous voulez traduire n'est pas dans le dictionnaire, vous devez laisser le mot dans son langage original. *Exemple*: - "I'm fond of Dean" deviendrait en français avec le dictionnaire ``fr``: "je suis amoureux de doyen" Notez qu'on ne s'attend pas à ce que vous donniez des traductions exactes mais bien une traduction mot par mot. De plus, les clés sont enregistrées en minuscules dans le dictionnaire. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>

source: Session 7: Apocalypse - Language translation
fr: Session 7 : Apocalypse - Traduction d'un langage

source: Implement the function ``translate(data, lan)`` in Python. With ``data`` as the string you wish to translate and dictionnaries named according to ``lan`` usable to do the translations in the target language.
fr: Implémentez la fonction ``translate(data, lan)`` en Python. Avec ``data`` comme la chaine de caractère que vous souhaiter traduire et les dictionnaires nommés selon ``lan`` utilisable pour faire les traductions dans le langage ciblé.

source: The expected translation of {} in {} is {} and you returned {}.
fr: La traduction attendue pour {} en {} est {} et vous avez retourné {}.

source: Gregory made the following code to iterate over the elements of ``matrix``. .. code-block:: python matrix = [ [8, 11, 4], [7, 12, 9], [0, -6, 0], ] sum_even = 0 for i in range(4): for j in range(4): elem = matrix[i][j] if elem%2 == 0: sum_even += matrix[i][j] As you can see, what he wanted was to **compute the sum of all the even values in the matrix**. However, when run, **his code crashes**. Find **where the mistake is** and **rewrite this code using ``while`` loops and iterators** (not ``for`` loops). You can consider ``matrix`` is provided (you don't have to create it) and that it will never contain something else than integers. Store the sum of the even number in a variable called ``sum_even`` as in the code above. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>
fr: Gregory a créé le code suivant pour itérer sur les éléments de ``matrix``. .. code-block:: python matrix = [ [8, 11, 4], [7, 12, 9], [0, -6, 0], ] sum_even = 0 for i in range(4): for j in range(4): elem = matrix[i][j] if elem%2 == 0: sum_even += matrix[i][j] Comme vous pouvez le voir, ce qu'il voulait faire était de **calculer la somme de toute les valeur paires dans la matrice**. Cependant, quand exécuté, **le code crash**. Trouvez **où se trouve l'erreur** et **réécrivez le code en utilisant une boucle ``while`` et des itérateurs** (pas de boucles ``for``). Vous pouvez considérer que ``matrix`` est fourni (donc vous ne devez pas le créer) et qu'elle ne contiendra jamais autre chose que des entiers. Enregistrez la somme des nombres pairs dans une variable nommée ``sum_even`` comme dans le code ci-dessus .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>

source: Session 7: Wrong iterations
fr: Session 7 : Mauvaises itérations

source: As a reminder, iterators typically have the following methods: .. code-block:: python class ExampleIterator: def __iter__(): # Returns the iterator itself ... def __next__(): # Returns the next element to iterate on ...
fr: Pour rapel, les itérateurs ont typiquement les méthodes suivantes : .. code-block:: python class ExampleIterator: def __iter__(): # retourne l'itérateur lui-même ... def __next__(): # retourne l'élément suivant sur lequel on va itérer ...
