Repository: Maxime2702/INGInious
Catalog: LSINF1101_adaptive/$common/student/$i18n/*.po
Languages: fr

source: Your program does not compile:
fr: Votre programme ne compile pas :

source: Your program prints: %s
fr: Votre programme affiche : %s

source: The program does not compile for external reasons,please contact an administrator asap:
fr: Le programme ne compile pas pour des raisons externes, merci de contacter un administrateur :

source: Failed test:
fr: Test échoué :

source: It seems that you have made mistakes in your code…
fr: Il semblerait que vous ayez fait des erreurs dans votre code...

source: You have made mistakes:
fr: Vous avez fait des erreurs :

source: You answered well this question
fr: Vous avez répondu correctement à cette question

source: As the new manager of an Amazon dispatch center, you have to create a class to represent the commands. A command have the following attributes : * the id of the buyer * the id of the item * the quantity of the item * the price of the item And must have the following methods : * ``get_price()`` : return the total price of the command * ``__str__()`` : return the command on the format : id_buyer, id_item : price * quantity = (price*quantity) *Example* : "12, 32 : 5 * 20 = 100" There must also be class methods : * ``get_number_total_commad()`` : return the total number of commands made * ``get_total_price()`` : return the total price of all the commands .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>
fr: En tant que nouveau manager d'un centre d'expédition d'Amazon, vous devez créer une classe pour représenter les commandes. Une commande a les attributs suivants : * l'id de l'acheteur (``id_buyer``) * l'id de l'objet (``id_item``) * la quantité (``quantity``) * le prix de l'objet (``price``) Et doit avoir les méthodes suivantes : * ``get_price()`` : retourne le prix total de la commande * ``__str__()`` : retourne la commande sous le format : id_buyer, id_item : price * quantity = (price*quantity) *Exemple* : "12, 32 : 5 * 20 = 100" Il doit aussi y avoir des méthodes de classe : * ``get_number_total_commad()`` : retourne le nombre total de commandes effectuées * ``get_total_price()`` : retourne le prix total de toutes les commandes .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>

source: Session 9: Amazon dispatch center
fr: Session 9 : centre d'expédition d'Amazon

source: Implementation
fr: Implémentation

source: Implement the class ``Command`` and the two methods in Python. We will create the object with: ``command = Command(id_buyer, id_item, quantity_item, price_item)`` and call the class method with: ``command.get_number_total_command()``
fr: Implémentez la classe ``Command`` et les deux méthodes en Python. Nous allons créer l'objet avec : ``command = Command(id_buyer, id_item, quantity_item, price_item)`` et appeler la méthode de classe avec : ``command.get_number_total_command()``

source: You did not provide the init or str methods.
fr: Vous n'avez pas fourni les méthodes init ou str.

source: With the following data: {}, {}, {}, {} for the command created, you returned {} instead of {}
fr: Avec les données suivantes: {}, {}, {}, {} pour la commande créée, vous avez retourné {} à la place de {}

source: you do not get the correct number of Command
fr: Vous n'obtenez pas le bon nombre de commandes

source: you do not get the correct total price of all Command
fr: Vous n'obtenez pas le prix total pour l'ensemble des commandes correct

source: As the manager of the Amazon Dispatch center, you also have to pay your -slaves- employees. To do so, you have to create a function ``pay_employee``, that take an ``employee`` in parameter and the ``number of hours`` it has worked. you then have to call the function ``receive_salary`` of the object ``employee`` with the argument ``hours_worked`` multiplied by the ``pay`` of the employee (an attribute of the object) The problem is that you know the data could have some problems. So you decide to create custom exception to take in account all possible problems. You have to create (and raise them if necessary) the following **exceptions** : * ``EmployeeDidntWorked`` : if the employee has worked 0 hours * ``EmployeeWorkedNegatively`` : if the employee worked less than 0 hours (Yes, the data can have weird problems) * ``EmployeeWorkedTooMuch`` : if the employee worked more than possible (24*31 = 744 hours) * ``PayIsNegative`` : if the pay of the employee is negative * ``PayIsTooBig`` : if an employee has a pay per hour bigger than 100$ .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>
fr: En tant que manager du centre d'expédition d'Amazon, vous devez aussi payer vos -esclaves- employés. Pour cela, vous devez créer une fonction ``pay_employee``, qui prend un ``employee`` comme paramètre et le ``number of hours`` qu'il a travaillé. Vous devez ensuite appeler la fonction ``receive_salary`` de l'objet ``employee``avec l'argument ``hours_worked`` multiplié par ``pay`` de l'employé (un attribut de l'objet). Certaines informations peuvent cependant être erronées, ce qui est un problème. Vous décidez donc de créer des exceptions sur mesure pour prendre en compte toutes les erreurs possibles. Vous devez créer (et lever si nécessaire) les **exceptions** suivantes : * ``EmployeeDidntWorked`` : si l'employé a travaillé 0 heure * ``EmployeeWorkedNegatively`` : si l'employé a travaillé moins de 0 heure (Oui, les informations peuvent avoir des problèmes bizarres) * ``EmployeeWorkedTooMuch`` : si l'employé a travaillé plus que ce qui est possible (24*31 = 744 heures) * ``PayIsNegative`` : si le salaire de l'employé est négatif * ``PayIsTooBig`` : si un employé a un salaire par heure plus élevé que 100$ .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>

source: Session 9: Amazon dispatch center must pay
fr: Session 9 : centre d'expédition d'Amazon à payer

source: Implement the 5 custom error and the function ``pay_employee(employee, hours_worked)`` The class ``employee`` is already implemented, and look like this : .. code-block:: python # attributes pay # the salary per hour # functions receive_salary(much) # receive salary of the month
fr: Implémenter les 5 erreurs spéciales et la fonction ``pay_employee(employee, hours_worked)`` La classe``employee`` est déjà implémentée et ressemble à ceci : .. code-block:: python # attributs pay # le salaire par heure # fonctions receive_salary(much) # le salaire reçu pour le mois

source: The function `pay_employee` does not exist.
fr: la fonction `pay_employee` n'existe pas.

source: your function pay_employees does not give the good salary to the employee, should be {} and you give {}
fr: Votre fonction pay_employees ne donne pas le bon salaire à l'employé. Ça devrait être {} mais vous donnez {}

source: the employee did not work, you should raise an exception
fr: L'employé n'a pas travaillé, vous devriez lever une exception

source: the employee worked negatively, you should raise an exception
fr: L'employé a travaillé un nombre d'heures négatif, vous devriez lever une exception

source: the employee worked too much, you should raise an exception
fr: L'employé a trop travaillé, vous devriez lever une exception

source: the employee is payed negatively, you should raise an exception
fr: L'employé a un salaire négatif, vous devriez lever une exception

source: The method ``average(list)`` returns the arithmetic mean of the elements contained in list, except if ``list`` is empty in which case it should return ``None``. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>
fr: La méthode ``average(list)`` retourne la moyenne arithmétique des éléments contenu dans list, sauf si ``list`` est vide auquel cas, elle devrait retourner ``None``. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>

source: Session 4: Average
fr: Session 4 : Moyenne

source: Provide the body of the following method: .. code-block:: python def average(list):
fr: Donnez le corps de la méthode suivante : .. code-block:: python def average(list):

source: The average of {} is {} and you returned {}.
fr: La moyenne de {} est {} et vous avez retourné {}.

source: When the list is empty you should return None.
fr: Quand la liste est vide vous devriez retourner None.

source: Lucie wants to take a bath, but her bathtub has a hole in it. When she opens the tap, **12L** water flows in the bathtub **every minute**, and **1L** flows out of the hole **every minute**. You would like to know **how many minutes** she would have to wait until the bathtub is filled with at least **80L** of water, and would also like to **simulate the growth of volume of water** in Python. First, compute the number of minutes needed to have **exactly 80L** in the bathtub (as a floating point number) and store it in a variable called ``filled_time``. Then, store the current volume of water in a variable called ``water_vol`` (starting at 0) and use a ``for`` loop in which, at each iteration (representing each minute), the volume of water would be added/removed the volume of water flowing out the tap/hole. In other word, on each iteration, ``water_vol`` should **increase by 12L and decrease by 1L**. The ``for`` loop should stop on the first iteration where the volume of water is larger than 80L. This can be computed from ``filled_time``. *Note: you can round a floating point number to the first larger integer using the following code:* .. code-block:: python import math float_nb = 3.14 int_nb = math.ceil(float_nb) # `int_nb` is equal to 4 .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>
fr: Lucie veut prendre un bain, mais sa baignoire est trouée. Si elle ouvre le robinet, **12L** coulent dans la baignoire **chaque minute**, et **1L** s'écoule par le trou **chaque minute**. Vous aimeriez savoir **combien de minutes** elle devra attendre pour que la baignoire contienne au moins **80L** d'eau, et aussi **simuler la croissance du volume de l'eau** en Python. D'abord, calculez le nombre de minutes nécessaires pour avoir **exactement 80L** dans la baignoire (exprimé en nombre à virgule flottante) et enregistrez-le dans une variable nommée ``filled_time``. Ensuite, enregistrez le volume d'eau actuel dans une variable nommée ``water_vol`` (qui commence à 0) et utilisez une boucle ``for`` dans laquelle, à chaque itération (représentant chaque minute), les volumes d'eau s'écoulant du robinet ou par le trou sont ajoutés/retirés du volume d'eau total. En d'autres termes, à chaque itération, ``water_vol`` devrait **augmenter de 12L et diminuer d'1L**. La boucle ``for`` devrait s'arrêter à la première itération où le volume d'eau dépasse les 80L. Ceci peut être calculé à partir de ``filled_time``. *Note: vous pouvez arrondir un nombre à virgule flottante au premier integer plus grand en utilisant le code suivant :* .. code-block:: python import math float_nb = 3.14 int_nb = math.ceil(float_nb) # `int_nb` est égal à 4 .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>

source: Session 1: Bathtub with a hole
fr: Session 1 : Beignoire avec un trou

source: You don't have the good answer when computing the time to fill the bathtub ({}min).
fr: Vous n'avez pas la bonne réponse quand vous calculez le temps nécessaire pour remplir la baignoire ({}min).

source: You did not name the variable `filled_time` correctly (is it out of the `for` loop?)
fr: Vous n'avez pas nommé la variable `filled_time` correctement. Est-elle hors de la boucle `for`?

source: You did not compute the right value for the volume of water ({}L). Did you do the right number of iterations?
fr: Vous n'avez pas calculé la bonne valeur pour le volume d'eau ({}L). Avez-vous fait le bon nombre d'itérations?

source: You did not name the variable `water_vol` correctly.
fr: Vous n'avez pas nommé la variable `water_vol` correctement.

source: You and your friends often **lend each other money**. Rather than using convenient applications to remember who owes how much money to who, you decide to make your own Python program for this task. Specifically, you would like to have a way to * tell **who owes money to whom**; * **change the money counts** when someone pays someone else back or when someone lends money to someone else; * **add a person** that borrows and/or lends money; * compute the **sum of all the money currently borrowed**. Note that at all times, any money lent to someone should be borrowed by the lender. In other words, if *Woody* has lent *3€* to *Buzz*, your program should say that *Buzz owes 3€ to Woody* and that *Woody owes -3€ to Buzz*. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>
fr: Vous et vos amis **vous prêtez souvent de l'argent**. Plutôt que d'utiliser une application spéciale pour se rappeler qui doit combien d'argent et à qui, vous décidez de faire votre propre programme python pour réaliser cette tâche. Spécifiquement, vous aimeriez pouvoir * dire **qui doit combien d'argent à qui**; * **changer les comptes** quand quelqu'un rembourse ou prête de l'argent à un autre; * **ajouter une personne** qui emprunte et/ou rembourse de l'argent; * calcule la **somme de tout l'argent emprunté à ce moment précis**. Notez que de l'argent prêté à quelqu'un doit être emprunté. En d'autres termes, si *Woody* a prêté *3€* à *Buzz*, votre programme devrait dire que *Buzz doit 3€ à Woody* et que *Woody doit -3€ à Buzz*. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>

source: Session 7: Debt reminder
fr: Session 7 : Rappel de dette

source: To do this, you will use a **dictionary of dictionaries** called ``borrowed_money``, indexed by the **names of the people** (as strings). The first index will be the name of the "borrower"; the second the name of the "lender". For example, if *Woody* has lent *3€* to *Buzz*, your dictionary should be as follows: .. code-block:: python borrowed_money["Buzz"]["Woody"] == 3 # Read "Buzz owes Woody 3€" borrowed_money["Woody"]["Buzz"] == -3 Consequently, you can get a dictionary which contains all the money Buzz borrows anyone: .. code-block:: python borrowed_money["Buzz"] == {"Woody": 3, "Hamm": 60, "Rex": -5} **Make a function** ``give_money(borrowed_money, from_person, to_person, amount)`` which would be called when ``from_person`` gives ``amount`` € to ``to_person`` (either because ``from_person`` lends money to ``to_person`` or because they pay back the money they borrowed). If any of the 2 people aren't already keys in the dictionary, they should be added to it. You should raise a ``ValueError`` in case someone tries to give money to themself. **Make another function** ``total_money_borrowed(borrowed_money)`` which will return the total amount of money borrowed at that time in the group (that is, the sum of the positive amounts of money in the dictionaries). *Note: you should raise a* ``ValueError`` *if any of the arguments fed to those functions are invalid (i.e. if names are not strings, if* ``borrowed_money`` *is not a dictionary or if the amount of money is not an integer or a float). You can test if a variable is of the right type in the following way:* .. code-block:: python variable = 5 type(variable) == int # returns True # OR isinstance(variable, int) # returns True Finally, **implement the example** that Mark lends Bill and Steve 2 000 000€, Serguei lends Bill 5 000 000€, Bill lends Larry 6 000 000€ and Larry lends Linus 5.5€. Then, Steve pays Mark back. This should be using the variable ``borrowed_money``.
fr: Pour faire cela, vous allez utiliser un **dictionnaire de dictionnaires** appelé ``borrowed_money``, indexé par le **nom des personnes** (comme des strings). Le premier index sera le nom de "l'emprunteur"; le deuxième, celui du "prêteur". Par exemple, si *Woody* a prêté *3€* à *Buzz*, votre dictionnaire devrait être comme suit: .. code-block:: python borrowed_money["Buzz"]["Woody"] == 3 # Lisez "Buzz doit 3€ à Woody" borrowed_money["Woody"]["Buzz"] == -3 Par conséquent, vous pouvez obtenir un dictionnaire qui contient tout l'argent que Buzz emprunte : .. code-block:: python borrowed_money["Buzz"] == {"Woody": 3, "Hamm": 60, "Rex": -5} **Faites une fonction** ``give_money(borrowed_money, from_person, to_person, amount)`` qui sera appelée quand ``from_person`` donne ``amount`` € à ``to_person`` (soit parce que ``from_person`` prête de l'argent ``to_person``, ou bien parce qu'il rembourse de l'argent qu'il a emprunter). Si une des deux personnes n'est pas déjà une clé dans le dictionnaire, elle doit y être ajoutée. Vous devez lever une ``ValueError`` dans le cas où quelqu'un essaye de se donner de l'argent à lui-même. **Faites une autre fonction** ``total_money_borrowed(borrowed_money)`` qui retourne le montant total d'argent emprunté en ce moment (c'est-à-dire, la somme des montants positifs se trouvant dans le dictionnaire). *Note: vous devez lever une* ``ValueError`` *si l'un des arguments passé à ces fonctions est invalide (c'est-à-dire si les noms ne sont pas de strings, si* ``borrowed_money`` *n'est pas un dictionnaire ou si le montant d'argent n'est pas un integer ou un float).Vous pouvez tester si une variable est du bon type des manières suivantes :* .. code-block:: python variable = 5 type(variable) == int # retourne True # OR isinstance(variable, int) # retourne True Enfin, **implémentez l'exemple** où Mark prête 2 000 000 € à Bill et Steve, Serguei prête 5 000 000 € à Bill, Bill prête 6 000 000 € à Larry et enfin, Larry prête 5,5 € à Linus. Ensuite, Steve rembourse Mark. Utilisez la variable ``borrowed_money``.

source: `borrowed_money` must be of type `dict`.
fr: `borrowed_money` doit être de type `dict`.

source: The variable `borrowed_money` doesn't exist.
fr: La variable `borrowed_money` n'existe pas.

source: The function `give_money` does not exist.
fr: La fonction `give_money` n'existe pas.

source: The function `total_money_borrowed` does not exist.
fr: La fonction `total_money_borrowed` n'existe pas.

source: After 5 transactions between 4 people, you got {} instead of {}.
fr: Après 5 transactions entre 4 personnes , vous avez {} àà la place de {}.

source: With {}, you computed a total amount of money borrowed of {} instead of {}.
fr: Avec {}, vous avez calculé un montant total emprunté de {} à la place de {}.

source: You wrongly raised an exception while using `give_money()` or `total_money_borrowed()` with valid arguments: {}('{}')
fr: Vous avez levé une exception lorsqu'elle n'était pas nécessaire en utilisant `give_money()` ou `total_money_borrowed()` avec les arguments valides : {}('{}')

source: You wrongly raised an exception while using `give_money()` with invalid arguments: {}('{}')
fr: Vous avez levé une exception lorsqu'elle n'était pas nécessaire en utilisant `give_money()` avec les arguments invalides : {}('{}')

source: You wrongly raised an exception while using `total_money_borrowed()` with invalid arguments: {}('{}')
fr: Vous avez levé une exception lorsqu'elle n'était pas nécessaire en utilisant `total_money_borrowed()` avec les arguments invalides : {}('{}')

source: For the example asked, you got an incorrect answer: {}
fr: Pour l'exemple demandé, vous avez eu un réponse incorrecte : {}
