Repository: Maxime2702/INGInious
Catalog: LSINF1101_adaptive/$common/student/$i18n/*.po
Languages: fr

source: Did the bludger hit you too hard? For the given score {} you decided {} won.
fr: Est-ce que le cognard vous a frappé trop fort? Pour le score donné {} vous avez décidé que {} a gagné.

source: Did the bludger hit you too hard? The match is supposed to end after the caught of the golden snitch.
fr: Est-ce que le cognard vous a frappé trop fort? Le match est censé se terminer une fois que le vif d'or a été attrapé.

source: During the last session of the **duelling club**, the hourglasses keeping the points of each house were destroyed beyond any *reparo* and the celebration of the *house cup* is upon us! Luckily **Filch**, who doesn't trust magic, kept the account of each achievement perpetrated (his words, not mine) by the students. He provided you with a dictionnary containing the belonging of each student to their house and the scroll with their winnings. The scores list would be provided as a file. The content of this file would follow this format: - Lines: **student_name** *points* Please return the name of the winning house, in the case of an ex-aequo: return the list of the best houses. In case of error, just raise it. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>
fr: Lors de la dernière session du **club de duel**, les sabliers comptant les points de chaque maison ont été détruits même un *reparo* n'a rien pu faire et la célébration de la *Coupe des Quatre Maisons* arrive à grands pas! Heureusement, **Rusard**, qui ne fait pas confiance à la magie, a gardé les comptes de tous les accomplissements perpétrés par les étudiants. Il vous a fourni un dictionnaire associant chaque élève à sa maison et un parchemin avec tous leurs gains. La liste des scores est donnée dans un fichier. Le contenu de ce fichier suit le format suivant : - Lignes: **student_name** *points* Merci de retourner le nom de la maison gagnante, dans le cas d'un ex-aequo : retournez une liste des meilleures maisons. S'il y a une erreur, levez une exception. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>

source: Session 7: Hogwarts - House cup
fr: Session 7 : Poudlard - Coupe des Quatre Maisons

source: Implement the function ``winning_house(scroll)`` in Python. You already have the list of student sorted by house at your disposal: .. code-block:: python students = {'gryffindor': ['Harry', 'Hermione', 'Ron', 'Ginny', 'Fred', ' Georges', 'Neville'], 'ravenclaw': ['Cho', 'Luna', 'Sybill', 'Marcus', 'Marietta', 'Terry', 'Penelope'], 'hufflepuff': ['Pomona', 'Zacharias', 'Teddy', 'Cedric', 'Nymphadora', 'Newton', 'Justin'], 'slytherin': ['Malfoy', 'Severus', 'Dolores', 'Horace', 'Blaise', 'Pansy', 'Bellatrix']}
fr: Implémentez la fonction ``winning_house(scroll)`` en Python. Vous avez déjà la liste des étudiants triés par maison à votre disposition : .. code-block:: python students = {'gryffindor': ['Harry', 'Hermione', 'Ron', 'Ginny', 'Fred', ' Georges', 'Neville'], 'ravenclaw': ['Cho', 'Luna', 'Sybill', 'Marcus', 'Marietta', 'Terry', 'Penelope'], 'hufflepuff': ['Pomona', 'Zacharias', 'Teddy', 'Cedric', 'Nymphadora', 'Newton', 'Justin'], 'slytherin': ['Malfoy', 'Severus', 'Dolores', 'Horace', 'Blaise', 'Pansy', 'Bellatrix']}

source: For the given students' achievements {} you decided {} won but {} clearly did.
fr: Pour les réussites d'un étudiant donné {} vous avez décidé que {} a gagné alors que c'est {} qui devait.

source: Suppose you now have ``base`` € on your savings account. If you leave it ``x`` years on that account at a fixed cummulative interest rate of ``y`` %, what will be the balance on your account after these ``x`` years? Return that amount. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>
fr: Supposez que vous avez ``base`` € en ce moment sur votre compte épargne. Si vous le laissez ``x`` années sur ce compte avec un taux d'intérêt cumulés de ``y`` %, quel sera le solde de votre compte après ces ``x`` années? Retournez ce montant. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>

source: Session 3: Interest calculation
fr: Session 3 : Calcul d'intérêts

source: Provide the body of the following method: .. code-block:: python def interests(base, y, x):
fr: Fournissez le corps de la méthode suivante : .. code-block:: python def interests(base, y, x):

source: When calling interests(base, y, x) with base = {}€ , y = {}% and x = {} years you returned {} but the expected value was {}.
fr: Quand vous appelez la méthode interests(base, y, x) avec base = {}€ , y = {}% et x = {} années vous avez retourné {}mais la valeur attendue était {}.

source: Suppose the variables ``a``, ``b`` and ``x`` contain a natural number. Write a code fragment that would assign the boolean value ``True`` to the variable named ``interval`` if ``x`` belongs to ``[a, b]``. Assign it the value ``False`` otherwise. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>
fr: Supposez que les variables ``a``, ``b`` et ``x`` contiennent un nombre naturel. Ecrivez un fragment de code qui assignerait la valeur booléenne ``True`` à une variable nommée ``interval`` si ``x`` appartient à ``[a, b]``. Assignez la valeur ``False`` sinon. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>

source: Session 2: Interval
fr: Session 2 : Intervalle

source: .. code-block:: python a = ... #lower bound of the interval b = ... #upper bound of the interval x = ... #variable to evaluate interval = ... #store in this variable the belonging of x in the interval
fr: .. code-block:: python a = ... #limite inférieure de l'intervalle b = ... #limite supérieure de l'intervalle x = ... #variable à évaluer interval = ... #enregistrez dans cette variable l'appartenance de x à l'intervalle

source: The belonging of {} to [{}, {}] is {} and you returned {}.
fr: L'appartenance de {} à [{}, {}] est {} et vous avez retourné {}.

source: Create a class LinkedList that has an ``add`` method which takes a value as parameter, and a ``get_reverse`` method which returns the values of the linked list in reverse order. If the ``add`` method is called like this: .. code-block:: python add("first") add("second") add("third") Then ``get_reverse()`` should return *"thirdsecondfirst"* Use another class ``Node`` with at least the methods ``get_value`` and ``get_next`` .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>
fr: Créez une classe LinkedList qui a une méthode ``add`` prenant une valeur en paramètre et une méthode ``get_reverse`` retournant les valeurs de la liste chaînée dans l'ordre inverse. Si la méthode ``add`` est appelée comme ceci : .. code-block:: python add("first") add("second") add("third") Alors ``get_reverse()`` devrait retourner *"thirdsecondfirst"* Utilisez une autre classe ``Node`` avec au moins les méthodes ``get_value`` et ``get_next`` .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>

source: Session 11: LinkedList
fr: Session 11 : Liste Chainée (LinkedList)

source: Implement the class ``LinkedList`` with ``add`` and ``get_reverse`` functions, use a ``Node`` class with ``get_next`` and ``get_value``
fr: Implémentez la classe ``LinkedList`` avec les fonctions``add`` et ``get_reverse``, utilisez une classe ``Node`` avec ``get_next`` et ``get_value``

source: You did not provide the LinkedList class
fr: Vous n'avez pas fourni la classe LinkedList

source: You did not provide the required methods
fr: Vous n'avez pas fourni les méthodes requises

source: You did not provide the Node class
fr: Vous n'avez pas fourni la classe Node

source: You did not provide the required methods in the Node class
fr: Vous n'avez pas fourni les méthodes requises pour la classe Node

source: When adding nothing get_reverse is supposed to return an empty string and you returned {}. You should watch you behaviour in case of empty lists.
fr: Quand on n'ajoute rien, get_reverse doit retourner une string vide et vous avez retourné {}. Vous devriez regarder le comportement de votre programme dans le cas des listes vides.

source: The answer should be {} and you returned {}.
fr: La réponse devrait être {} et vous avez retourné {}.

source: You are the manager of a vacation camp. To make sure you don't lose any children in your visit of a local forest, every children must look to a buddy, which will look to another buddy, etc. Until every children has a buddy and is the buddy of someone. You are sure that if you take a children, and follow the trail of buddies, you will visit all children. To check if every child is here, you just need to check that every children has his buddy, and check that for all children. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>
fr: Vous êtes le manager d'un camp de vacances. Pour vous assurer de ne perdre aucun enfant lors de votre visite d'une forêt locale, chaque enfant doit regarder un camarade qui lui-même regardera un camarade, etc. Jusqu'à ce que chaque enfant ait un camarade et qu'il soit le camarade de quelqu'un. Vous êtes sûrs que si vous choisissez un enfant et suivez le chemin de camarades, vous allez voir tous les enfants. Pour vérifier si chaque enfant est là, vous devez juste vérifier que chaque enfant à son camarade, et le vérifier pour tous. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>

source: Session 11 : Lost Children
fr: Session 11 : Enfants perdus

source: Check the children
fr: Vérifiez les enfants

source: You have to check if every children is here. To do so, you have acces to the first child with the variable ``first_child`` (instance of the class Child). The class Child has the function is_next_valid to check if it has his buddy, and the function next_child to get his buddy. .. code-block:: python class Child: def is_next_valid() #return a boolean def next_child() #return a Child Don't forget to stop checking once you have checked every children. You have to complete the body of the function, and return true if all the children are here, and false if not. .. code-block:: python def is_every_child_here(first_child):
fr: Vous devez vérifier si chaque enfant est là. Pour cela, vous avez accès au premier enfant avec la variable ``first_child`` (instance de la classe Child). La classe Child a la fonction is_next_valid pour vérifier si il a son camarade, et la fonction next_child pour avoir son camarade. .. code-block:: python class Child: def is_next_valid() #retourne un booléen def next_child() #retourne un Child N'oubliez pas d'arrêter de regarder une fois que vous avez regardé tous les enfants. Vous devez compléter le corps de la fonction, et retourner `true` si tous les enfants sont là, et `false` sinon. .. code-block:: python def is_every_child_here(first_child):

source: Be sure you stop once you are back to the first children. You don't want to have more than you already have...
fr: Assurez-vous d'arrêter de regarder dans vous arrivez de nouveau au premier enfant. Vous ne voulez pas en avoir plus que ceux que vous avez déjà...

source: Well... You got it wrong, so try again. Are you blind? Everyone's there!
fr: Eh bien... Vous vous êtes trompés, essayez encore! Etes-vous aveugle? Tout le monde est là!

source: Well... You got it wrong, so try again. You actually lost a child
fr: Eh bien... Vous vous êtes trompés, essayez encore! Vous avez perdu un enfant...

source: For your next big game, *God of massive destruction Game Of The Century edition*, you have to create a function to load and to save the data of the player. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>
fr: Pour votre prochain gros jeu, *Dieu de la Destruction Massive : Edition Jeu du Siècle*, vous devez créer une fonction pour charger et sauvegarder les données du joueur. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>

source: Session 6 : Save your game
fr: Session 6 : Sauvegarder le jeu

source: Save and Load
fr: Sauvegarder et Charger

source: You have to create two function, one to save the data and one to load the data previously saved. You are free to store the data like you want in the file, but putting one integer per line is probably the easiest. If there is no file to load when using the function load_data (for exemple, the player starts a new game), you must raise a ``FileNotFoundError``. The two function will have these definition : .. code-block:: python #save the 4 integer to the file named filename def save_data(filename, life, mana, position_x, position_y) #return a tuple containing (life, mana, position_x, position_y) previously saved def load_data(filename)
fr: Vous devez créer deux fonctions : une pour sauvegarder les données et une pour les charger. Vous êtes libres d'enregistrer les données comme vous le souhaitez dans le fichier, mais placer un entier par ligne est probablement la méthode la plus simple. S'il n'y a pas de fichier à charger quand vous voulez utiliser le fontion load_data (par exemple, le joueur commence un nouveau jeu), vous devez lever une ``FileNotFoundError``. Les deux fonctions auront ces définitions : .. code-block:: python #sauvegarder les 4 entiers dans le fichier nommé filename def save_data(filename, life, mana, position_x, position_y) #retourne un tuple contenant les valeurs (life, mana, position_x et position_y précédemment sauvegardées def load_data(filename)

source: You don't even create a file... This is a bit annoying for a saving function
fr: Vous ne créez même pas de fichier... C'est un peu embêtant pour enregistrer des informations.

source: the player can't start a new game, and is very sad... Check that the file exist
fr: Le joueur ne peut pas commencer de nouvelle partie et il est très déçu... Vérifiez que ce fichier existe

source: The player loaded the wrong value.
fr: Le joueur a chargé la mauvaise valeur

source: The method ``maximum(lst)`` returns the maximum of the elements contained in the list ``lst``. The value ``None`` is returned if the list ``lst`` is empty. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>
fr: La méthode ``maximum(lst)`` retourne le maximum des éléments contenus dans la liste ``lst``. La valeur ``None`` est retournée si la liste ``lst`` est vide. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>

source: Implement the function ``maximum(lst)`` in Python.
fr: Implémentez la fonction ``maximum(lst)`` en Python.

source: The maximum of {} is {} and you returned {}.
fr: Le maximum de {} est {} et vous avez retourné {}.

source: Suppose the variables ``a``, ``b`` and ``c`` contain a natural number. Write a code fragment that assigns to the variable ``median`` the median value of these numbers. As a reminder, the median of three values is the value such that there is exactly one value lower than (or equal to) it and one value higher than (or equal to) it. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>
fr: Supposez que les variables ``a``, ``b`` et ``c`` contiennent un nombre naturel. Écrivez un fragment de code qui assigne à la variable ``median`` la valeur médiane de ces nombres. Pour rappel, la médiane de trois valeurs est la valeur telle qu'il y a exactement une valeur inférieure (ou égale) et une valeur supérieure (ou égale) à cette valeur. .. raw:: html <script defer> bodyHeight = 0; function postSize() { if (document.body.scrollHeight != bodyHeight) { bodyHeight = document.body.scrollHeight; window.parent.postMessage({height: document.body.scrollHeight}, "*"); } }; var target = document.querySelector('body'); var observer = new MutationObserver(postSize); var config = { attributes: true, subtree: true } observer.observe(target, config); $(document).ready(function(){ setTimeout(postSize, 0); }); </script>

source: Session 2: Median
fr: Session 2 : Médiane

source: .. code-block:: python a = ... #variable to evaluate b = ... #variable to evaluate c = ... #variable to evaluate median = ... #store in this variable the median of the three variables
fr: .. code-block:: python a = ... #variable à évaluer b = ... #variable à évaluer c = ... #variable à évaluer median = ... #enregistrez dans cette variable la médiane des trois variables

source: The median of {} is {} and you returned {}.
fr: La médiane de {} est {} et vous avez retourné {}.
